Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
/**
 * \brief Component description for CFG
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-01-20T19:13:31Z */
#ifndef _BZ45_CFG_COMPONENT_H_
#define _BZ45_CFG_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CFG                                          */
/* ************************************************************************** */

/* -------- CFG_CFGCON0 : (CFG Offset: 0x00) (R/W 32)  -------- */
#define CFG_CFGCON0_RESETVALUE                _U_(0x7100000B)                                      /**<  (CFG_CFGCON0)   Reset Value */

#define CFG_CFGCON0_TDOEN_Pos                 _U_(0)                                               /**< (CFG_CFGCON0) TDO enable for 2-wire JTAG Position */
#define CFG_CFGCON0_TDOEN_Msk                 (_U_(0x1) << CFG_CFGCON0_TDOEN_Pos)                  /**< (CFG_CFGCON0) TDO enable for 2-wire JTAG Mask */
#define CFG_CFGCON0_TDOEN(value)              (CFG_CFGCON0_TDOEN_Msk & ((value) << CFG_CFGCON0_TDOEN_Pos))
#define CFG_CFGCON0_SWOEN_Pos                 _U_(1)                                               /**< (CFG_CFGCON0) SWO enable on 2-wire debug interface Position */
#define CFG_CFGCON0_SWOEN_Msk                 (_U_(0x1) << CFG_CFGCON0_SWOEN_Pos)                  /**< (CFG_CFGCON0) SWO enable on 2-wire debug interface Mask */
#define CFG_CFGCON0_SWOEN(value)              (CFG_CFGCON0_SWOEN_Msk & ((value) << CFG_CFGCON0_SWOEN_Pos))
#define CFG_CFGCON0_TROEN_Pos                 _U_(2)                                               /**< (CFG_CFGCON0) Trace Output Enable Position */
#define CFG_CFGCON0_TROEN_Msk                 (_U_(0x1) << CFG_CFGCON0_TROEN_Pos)                  /**< (CFG_CFGCON0) Trace Output Enable Mask */
#define CFG_CFGCON0_TROEN(value)              (CFG_CFGCON0_TROEN_Msk & ((value) << CFG_CFGCON0_TROEN_Pos))
#define CFG_CFGCON0_JTAGEN_Pos                _U_(3)                                               /**< (CFG_CFGCON0) JTAG Enable Position */
#define CFG_CFGCON0_JTAGEN_Msk                (_U_(0x1) << CFG_CFGCON0_JTAGEN_Pos)                 /**< (CFG_CFGCON0) JTAG Enable Mask */
#define CFG_CFGCON0_JTAGEN(value)             (CFG_CFGCON0_JTAGEN_Msk & ((value) << CFG_CFGCON0_JTAGEN_Pos))
#define CFG_CFGCON0_ADCPOVR_Pos               _U_(4)                                               /**< (CFG_CFGCON0) ADC Charge Pump Override Position */
#define CFG_CFGCON0_ADCPOVR_Msk               (_U_(0x1) << CFG_CFGCON0_ADCPOVR_Pos)                /**< (CFG_CFGCON0) ADC Charge Pump Override Mask */
#define CFG_CFGCON0_ADCPOVR(value)            (CFG_CFGCON0_ADCPOVR_Msk & ((value) << CFG_CFGCON0_ADCPOVR_Pos))
#define CFG_CFGCON0_GPSOSCE_Pos               _U_(5)                                               /**< (CFG_CFGCON0) GPIO/SOSC Enable Position */
#define CFG_CFGCON0_GPSOSCE_Msk               (_U_(0x1) << CFG_CFGCON0_GPSOSCE_Pos)                /**< (CFG_CFGCON0) GPIO/SOSC Enable Mask */
#define CFG_CFGCON0_GPSOSCE(value)            (CFG_CFGCON0_GPSOSCE_Msk & ((value) << CFG_CFGCON0_GPSOSCE_Pos))
#define CFG_CFGCON0_ACCMP1_ALTEN_Pos          _U_(6)                                               /**< (CFG_CFGCON0) AC CMP1 Alternate Enable Position */
#define CFG_CFGCON0_ACCMP1_ALTEN_Msk          (_U_(0x1) << CFG_CFGCON0_ACCMP1_ALTEN_Pos)           /**< (CFG_CFGCON0) AC CMP1 Alternate Enable Mask */
#define CFG_CFGCON0_ACCMP1_ALTEN(value)       (CFG_CFGCON0_ACCMP1_ALTEN_Msk & ((value) << CFG_CFGCON0_ACCMP1_ALTEN_Pos))
#define CFG_CFGCON0_CPENFILT_Pos              _U_(7)                                               /**< (CFG_CFGCON0) ADC CP Filter Enable Position */
#define CFG_CFGCON0_CPENFILT_Msk              (_U_(0x1) << CFG_CFGCON0_CPENFILT_Pos)               /**< (CFG_CFGCON0) ADC CP Filter Enable Mask */
#define CFG_CFGCON0_CPENFILT(value)           (CFG_CFGCON0_CPENFILT_Msk & ((value) << CFG_CFGCON0_CPENFILT_Pos))
#define CFG_CFGCON0_RTCIN0_ALTEN_Pos          _U_(8)                                               /**< (CFG_CFGCON0) RTCIN0 Alternate Enable Position */
#define CFG_CFGCON0_RTCIN0_ALTEN_Msk          (_U_(0x1) << CFG_CFGCON0_RTCIN0_ALTEN_Pos)           /**< (CFG_CFGCON0) RTCIN0 Alternate Enable Mask */
#define CFG_CFGCON0_RTCIN0_ALTEN(value)       (CFG_CFGCON0_RTCIN0_ALTEN_Msk & ((value) << CFG_CFGCON0_RTCIN0_ALTEN_Pos))
#define CFG_CFGCON0_RTCOUT_ALTEN_Pos          _U_(9)                                               /**< (CFG_CFGCON0) RTCOUT Alternate Enable Position */
#define CFG_CFGCON0_RTCOUT_ALTEN_Msk          (_U_(0x1) << CFG_CFGCON0_RTCOUT_ALTEN_Pos)           /**< (CFG_CFGCON0) RTCOUT Alternate Enable Mask */
#define CFG_CFGCON0_RTCOUT_ALTEN(value)       (CFG_CFGCON0_RTCOUT_ALTEN_Msk & ((value) << CFG_CFGCON0_RTCOUT_ALTEN_Pos))
#define CFG_CFGCON0_PMULOCK_Pos               _U_(10)                                              /**< (CFG_CFGCON0) PMU Controller Register LOCK Position */
#define CFG_CFGCON0_PMULOCK_Msk               (_U_(0x1) << CFG_CFGCON0_PMULOCK_Pos)                /**< (CFG_CFGCON0) PMU Controller Register LOCK Mask */
#define CFG_CFGCON0_PMULOCK(value)            (CFG_CFGCON0_PMULOCK_Msk & ((value) << CFG_CFGCON0_PMULOCK_Pos))
#define CFG_CFGCON0_PGLCOK_Pos                _U_(11)                                              /**< (CFG_CFGCON0) Permission Group LOCK Position */
#define CFG_CFGCON0_PGLCOK_Msk                (_U_(0x1) << CFG_CFGCON0_PGLCOK_Pos)                 /**< (CFG_CFGCON0) Permission Group LOCK Mask */
#define CFG_CFGCON0_PGLCOK(value)             (CFG_CFGCON0_PGLCOK_Msk & ((value) << CFG_CFGCON0_PGLCOK_Pos))
#define CFG_CFGCON0_PMDLOCK_Pos               _U_(12)                                              /**< (CFG_CFGCON0) Peripheral Module Disable (PMD) LOCK Position */
#define CFG_CFGCON0_PMDLOCK_Msk               (_U_(0x1) << CFG_CFGCON0_PMDLOCK_Pos)                /**< (CFG_CFGCON0) Peripheral Module Disable (PMD) LOCK Mask */
#define CFG_CFGCON0_PMDLOCK(value)            (CFG_CFGCON0_PMDLOCK_Msk & ((value) << CFG_CFGCON0_PMDLOCK_Pos))
#define CFG_CFGCON0_IOLOCK_Pos                _U_(13)                                              /**< (CFG_CFGCON0) IO LOCK Position */
#define CFG_CFGCON0_IOLOCK_Msk                (_U_(0x1) << CFG_CFGCON0_IOLOCK_Pos)                 /**< (CFG_CFGCON0) IO LOCK Mask */
#define CFG_CFGCON0_IOLOCK(value)             (CFG_CFGCON0_IOLOCK_Msk & ((value) << CFG_CFGCON0_IOLOCK_Pos))
#define CFG_CFGCON0_CFGCLOCK_Pos              _U_(14)                                              /**< (CFG_CFGCON0) Configuration Register Lock Position */
#define CFG_CFGCON0_CFGCLOCK_Msk              (_U_(0x3) << CFG_CFGCON0_CFGCLOCK_Pos)               /**< (CFG_CFGCON0) Configuration Register Lock Mask */
#define CFG_CFGCON0_CFGCLOCK(value)           (CFG_CFGCON0_CFGCLOCK_Msk & ((value) << CFG_CFGCON0_CFGCLOCK_Pos))
#define CFG_CFGCON0_VBCMODE_Pos               _U_(16)                                              /**< (CFG_CFGCON0) VBC Operating Mode Position */
#define CFG_CFGCON0_VBCMODE_Msk               (_U_(0x1) << CFG_CFGCON0_VBCMODE_Pos)                /**< (CFG_CFGCON0) VBC Operating Mode Mask */
#define CFG_CFGCON0_VBCMODE(value)            (CFG_CFGCON0_VBCMODE_Msk & ((value) << CFG_CFGCON0_VBCMODE_Pos))
#define CFG_CFGCON0_SMBUSEN0_Pos              _U_(17)                                              /**< (CFG_CFGCON0) SMBus Enable for SERCOM0 Position */
#define CFG_CFGCON0_SMBUSEN0_Msk              (_U_(0x1) << CFG_CFGCON0_SMBUSEN0_Pos)               /**< (CFG_CFGCON0) SMBus Enable for SERCOM0 Mask */
#define CFG_CFGCON0_SMBUSEN0(value)           (CFG_CFGCON0_SMBUSEN0_Msk & ((value) << CFG_CFGCON0_SMBUSEN0_Pos))
#define CFG_CFGCON0_SMBUSEN1_Pos              _U_(18)                                              /**< (CFG_CFGCON0) SMBus Enable for SERCOM1 Position */
#define CFG_CFGCON0_SMBUSEN1_Msk              (_U_(0x1) << CFG_CFGCON0_SMBUSEN1_Pos)               /**< (CFG_CFGCON0) SMBus Enable for SERCOM1 Mask */
#define CFG_CFGCON0_SMBUSEN1(value)           (CFG_CFGCON0_SMBUSEN1_Msk & ((value) << CFG_CFGCON0_SMBUSEN1_Pos))
#define CFG_CFGCON0_SMBUSEN2_Pos              _U_(19)                                              /**< (CFG_CFGCON0) SMBus Enable for SERCOM2 Position */
#define CFG_CFGCON0_SMBUSEN2_Msk              (_U_(0x1) << CFG_CFGCON0_SMBUSEN2_Pos)               /**< (CFG_CFGCON0) SMBus Enable for SERCOM2 Mask */
#define CFG_CFGCON0_SMBUSEN2(value)           (CFG_CFGCON0_SMBUSEN2_Msk & ((value) << CFG_CFGCON0_SMBUSEN2_Pos))
#define CFG_CFGCON0_HPLUGDIS_Pos              _U_(20)                                              /**< (CFG_CFGCON0) Hot Plugging Disable Position */
#define CFG_CFGCON0_HPLUGDIS_Msk              (_U_(0x1) << CFG_CFGCON0_HPLUGDIS_Pos)               /**< (CFG_CFGCON0) Hot Plugging Disable Mask */
#define CFG_CFGCON0_HPLUGDIS(value)           (CFG_CFGCON0_HPLUGDIS_Msk & ((value) << CFG_CFGCON0_HPLUGDIS_Pos))
#define CFG_CFGCON0_SLRTEN0_Pos               _U_(21)                                              /**< (CFG_CFGCON0) SLRT Enable for SERCOM0 Position */
#define CFG_CFGCON0_SLRTEN0_Msk               (_U_(0x1) << CFG_CFGCON0_SLRTEN0_Pos)                /**< (CFG_CFGCON0) SLRT Enable for SERCOM0 Mask */
#define CFG_CFGCON0_SLRTEN0(value)            (CFG_CFGCON0_SLRTEN0_Msk & ((value) << CFG_CFGCON0_SLRTEN0_Pos))
#define CFG_CFGCON0_SLRTEN1_Pos               _U_(22)                                              /**< (CFG_CFGCON0) SLRT Enable for SERCOM1 Position */
#define CFG_CFGCON0_SLRTEN1_Msk               (_U_(0x1) << CFG_CFGCON0_SLRTEN1_Pos)                /**< (CFG_CFGCON0) SLRT Enable for SERCOM1 Mask */
#define CFG_CFGCON0_SLRTEN1(value)            (CFG_CFGCON0_SLRTEN1_Msk & ((value) << CFG_CFGCON0_SLRTEN1_Pos))
#define CFG_CFGCON0_SLRTEN2_Pos               _U_(23)                                              /**< (CFG_CFGCON0) SLRT Enable for SERCOM2 Position */
#define CFG_CFGCON0_SLRTEN2_Msk               (_U_(0x1) << CFG_CFGCON0_SLRTEN2_Pos)                /**< (CFG_CFGCON0) SLRT Enable for SERCOM2 Mask */
#define CFG_CFGCON0_SLRTEN2(value)            (CFG_CFGCON0_SLRTEN2_Msk & ((value) << CFG_CFGCON0_SLRTEN2_Pos))
#define CFG_CFGCON0_PCM_Pos                   _U_(24)                                              /**< (CFG_CFGCON0) PCHE I/D Cacheable Mode Position */
#define CFG_CFGCON0_PCM_Msk                   (_U_(0x1) << CFG_CFGCON0_PCM_Pos)                    /**< (CFG_CFGCON0) PCHE I/D Cacheable Mode Mask */
#define CFG_CFGCON0_PCM(value)                (CFG_CFGCON0_PCM_Msk & ((value) << CFG_CFGCON0_PCM_Pos))
#define CFG_CFGCON0_INT0E_Pos                 _U_(25)                                              /**< (CFG_CFGCON0) INT0 Enable Position */
#define CFG_CFGCON0_INT0E_Msk                 (_U_(0x1) << CFG_CFGCON0_INT0E_Pos)                  /**< (CFG_CFGCON0) INT0 Enable Mask */
#define CFG_CFGCON0_INT0E(value)              (CFG_CFGCON0_INT0E_Msk & ((value) << CFG_CFGCON0_INT0E_Pos))
#define CFG_CFGCON0_INT0P_Pos                 _U_(26)                                              /**< (CFG_CFGCON0) INT0P Polarity Position */
#define CFG_CFGCON0_INT0P_Msk                 (_U_(0x1) << CFG_CFGCON0_INT0P_Pos)                  /**< (CFG_CFGCON0) INT0P Polarity Mask */
#define CFG_CFGCON0_INT0P(value)              (CFG_CFGCON0_INT0P_Msk & ((value) << CFG_CFGCON0_INT0P_Pos))
#define CFG_CFGCON0_FECCCON_Pos               _U_(28)                                              /**< (CFG_CFGCON0) Flash ECC Control Position */
#define CFG_CFGCON0_FECCCON_Msk               (_U_(0x3) << CFG_CFGCON0_FECCCON_Pos)                /**< (CFG_CFGCON0) Flash ECC Control Mask */
#define CFG_CFGCON0_FECCCON(value)            (CFG_CFGCON0_FECCCON_Msk & ((value) << CFG_CFGCON0_FECCCON_Pos))
#define CFG_CFGCON0_FRECCDIS_Pos              _U_(30)                                              /**< (CFG_CFGCON0) Flex RAM ECC Control Position */
#define CFG_CFGCON0_FRECCDIS_Msk              (_U_(0x1) << CFG_CFGCON0_FRECCDIS_Pos)               /**< (CFG_CFGCON0) Flex RAM ECC Control Mask */
#define CFG_CFGCON0_FRECCDIS(value)           (CFG_CFGCON0_FRECCDIS_Msk & ((value) << CFG_CFGCON0_FRECCDIS_Pos))
#define CFG_CFGCON0_Msk                       _U_(0x77FFFFFF)                                      /**< (CFG_CFGCON0) Register Mask  */

#define CFG_CFGCON0_SMBUSEN_Pos               _U_(17)                                              /**< (CFG_CFGCON0 Position) SMBus Enable for SERCOMx */
#define CFG_CFGCON0_SMBUSEN_Msk               (_U_(0x7) << CFG_CFGCON0_SMBUSEN_Pos)                /**< (CFG_CFGCON0 Mask) SMBUSEN */
#define CFG_CFGCON0_SMBUSEN(value)            (CFG_CFGCON0_SMBUSEN_Msk & ((value) << CFG_CFGCON0_SMBUSEN_Pos)) 
#define CFG_CFGCON0_SLRTEN_Pos                _U_(21)                                              /**< (CFG_CFGCON0 Position) SLRT Enable for SERCOMx */
#define CFG_CFGCON0_SLRTEN_Msk                (_U_(0x7) << CFG_CFGCON0_SLRTEN_Pos)                 /**< (CFG_CFGCON0 Mask) SLRTEN */
#define CFG_CFGCON0_SLRTEN(value)             (CFG_CFGCON0_SLRTEN_Msk & ((value) << CFG_CFGCON0_SLRTEN_Pos)) 

