Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
/* -------- CFG_CFGCON1 : (CFG Offset: 0x10) (R/W 32)  -------- */
#define CFG_CFGCON1_RESETVALUE                _U_(0x1F00443B)                                      /**<  (CFG_CFGCON1)   Reset Value */

#define CFG_CFGCON1_DEBUG_Pos                 _U_(0)                                               /**< (CFG_CFGCON1) Background Debugger Access Selection Position */
#define CFG_CFGCON1_DEBUG_Msk                 (_U_(0x3) << CFG_CFGCON1_DEBUG_Pos)                  /**< (CFG_CFGCON1) Background Debugger Access Selection Mask */
#define CFG_CFGCON1_DEBUG(value)              (CFG_CFGCON1_DEBUG_Msk & ((value) << CFG_CFGCON1_DEBUG_Pos))
#define CFG_CFGCON1_ICESEL_Pos                _U_(3)                                               /**< (CFG_CFGCON1) EMUC/EMUD Communication Channel Select Position */
#define CFG_CFGCON1_ICESEL_Msk                (_U_(0x3) << CFG_CFGCON1_ICESEL_Pos)                 /**< (CFG_CFGCON1) EMUC/EMUD Communication Channel Select Mask */
#define CFG_CFGCON1_ICESEL(value)             (CFG_CFGCON1_ICESEL_Msk & ((value) << CFG_CFGCON1_ICESEL_Pos))
#define CFG_CFGCON1_TRCEN_Pos                 _U_(5)                                               /**< (CFG_CFGCON1) Trace Enable Position */
#define CFG_CFGCON1_TRCEN_Msk                 (_U_(0x1) << CFG_CFGCON1_TRCEN_Pos)                  /**< (CFG_CFGCON1) Trace Enable Mask */
#define CFG_CFGCON1_TRCEN(value)              (CFG_CFGCON1_TRCEN_Msk & ((value) << CFG_CFGCON1_TRCEN_Pos))
#define CFG_CFGCON1_ZBTWKSYS_Pos              _U_(7)                                               /**< (CFG_CFGCON1) ZBT Subsystem External Wake-up source Position */
#define CFG_CFGCON1_ZBTWKSYS_Msk              (_U_(0x1) << CFG_CFGCON1_ZBTWKSYS_Pos)               /**< (CFG_CFGCON1) ZBT Subsystem External Wake-up source Mask */
#define CFG_CFGCON1_ZBTWKSYS(value)           (CFG_CFGCON1_ZBTWKSYS_Msk & ((value) << CFG_CFGCON1_ZBTWKSYS_Pos))
#define CFG_CFGCON1_CMP0_OE_Pos               _U_(8)                                               /**< (CFG_CFGCON1) Analog Comparator-0 Output Enable Position */
#define CFG_CFGCON1_CMP0_OE_Msk               (_U_(0x1) << CFG_CFGCON1_CMP0_OE_Pos)                /**< (CFG_CFGCON1) Analog Comparator-0 Output Enable Mask */
#define CFG_CFGCON1_CMP0_OE(value)            (CFG_CFGCON1_CMP0_OE_Msk & ((value) << CFG_CFGCON1_CMP0_OE_Pos))
#define CFG_CFGCON1_CMP1_OE_Pos               _U_(9)                                               /**< (CFG_CFGCON1) Analog Comparator-1 Output Enable Position */
#define CFG_CFGCON1_CMP1_OE_Msk               (_U_(0x1) << CFG_CFGCON1_CMP1_OE_Pos)                /**< (CFG_CFGCON1) Analog Comparator-1 Output Enable Mask */
#define CFG_CFGCON1_CMP1_OE(value)            (CFG_CFGCON1_CMP1_OE_Msk & ((value) << CFG_CFGCON1_CMP1_OE_Pos))
#define CFG_CFGCON1_CLASSBDIS_Pos             _U_(10)                                              /**< (CFG_CFGCON1) Disable CLASSB Device Functionality Position */
#define CFG_CFGCON1_CLASSBDIS_Msk             (_U_(0x1) << CFG_CFGCON1_CLASSBDIS_Pos)              /**< (CFG_CFGCON1) Disable CLASSB Device Functionality Mask */
#define CFG_CFGCON1_CLASSBDIS(value)          (CFG_CFGCON1_CLASSBDIS_Msk & ((value) << CFG_CFGCON1_CLASSBDIS_Pos))
#define CFG_CFGCON1_SLRCTRL0_Pos              _U_(11)                                              /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM0 Position */
#define CFG_CFGCON1_SLRCTRL0_Msk              (_U_(0x1) << CFG_CFGCON1_SLRCTRL0_Pos)               /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM0 Mask */
#define CFG_CFGCON1_SLRCTRL0(value)           (CFG_CFGCON1_SLRCTRL0_Msk & ((value) << CFG_CFGCON1_SLRCTRL0_Pos))
#define CFG_CFGCON1_SLRCTRL1_Pos              _U_(12)                                              /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM1 Position */
#define CFG_CFGCON1_SLRCTRL1_Msk              (_U_(0x1) << CFG_CFGCON1_SLRCTRL1_Pos)               /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM1 Mask */
#define CFG_CFGCON1_SLRCTRL1(value)           (CFG_CFGCON1_SLRCTRL1_Msk & ((value) << CFG_CFGCON1_SLRCTRL1_Pos))
#define CFG_CFGCON1_SLRCTRL2_Pos              _U_(13)                                              /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM2 Position */
#define CFG_CFGCON1_SLRCTRL2_Msk              (_U_(0x1) << CFG_CFGCON1_SLRCTRL2_Pos)               /**< (CFG_CFGCON1) I2C Slew Rate Control for SERCOM2 Mask */
#define CFG_CFGCON1_SLRCTRL2(value)           (CFG_CFGCON1_SLRCTRL2_Msk & ((value) << CFG_CFGCON1_SLRCTRL2_Pos))
#define CFG_CFGCON1_SMCLR_Pos                 _U_(14)                                              /**< (CFG_CFGCON1) Selects CRU handling of MCLR Control Position */
#define CFG_CFGCON1_SMCLR_Msk                 (_U_(0x1) << CFG_CFGCON1_SMCLR_Pos)                  /**< (CFG_CFGCON1) Selects CRU handling of MCLR Control Mask */
#define CFG_CFGCON1_SMCLR(value)              (CFG_CFGCON1_SMCLR_Msk & ((value) << CFG_CFGCON1_SMCLR_Pos))
#define CFG_CFGCON1_QSCHE_EN_Pos              _U_(15)                                              /**< (CFG_CFGCON1) QSPI Address Space Cache Attribute Position */
#define CFG_CFGCON1_QSCHE_EN_Msk              (_U_(0x1) << CFG_CFGCON1_QSCHE_EN_Pos)               /**< (CFG_CFGCON1) QSPI Address Space Cache Attribute Mask */
#define CFG_CFGCON1_QSCHE_EN(value)           (CFG_CFGCON1_QSCHE_EN_Msk & ((value) << CFG_CFGCON1_QSCHE_EN_Pos))
#define CFG_CFGCON1_QSPI_HSEN_Pos             _U_(16)                                              /**< (CFG_CFGCON1) QSPI (Direct) Enable Position */
#define CFG_CFGCON1_QSPI_HSEN_Msk             (_U_(0x1) << CFG_CFGCON1_QSPI_HSEN_Pos)              /**< (CFG_CFGCON1) QSPI (Direct) Enable Mask */
#define CFG_CFGCON1_QSPI_HSEN(value)          (CFG_CFGCON1_QSPI_HSEN_Msk & ((value) << CFG_CFGCON1_QSPI_HSEN_Pos))
#define CFG_CFGCON1_SCOM0_HSEN_Pos            _U_(17)                                              /**< (CFG_CFGCON1) SERCOM0 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM0_HSEN_Msk            (_U_(0x1) << CFG_CFGCON1_SCOM0_HSEN_Pos)             /**< (CFG_CFGCON1) SERCOM0 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM0_HSEN(value)         (CFG_CFGCON1_SCOM0_HSEN_Msk & ((value) << CFG_CFGCON1_SCOM0_HSEN_Pos))
#define CFG_CFGCON1_SCOM1_HSEN_Pos            _U_(18)                                              /**< (CFG_CFGCON1) SERCOM1 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM1_HSEN_Msk            (_U_(0x1) << CFG_CFGCON1_SCOM1_HSEN_Pos)             /**< (CFG_CFGCON1) SERCOM1 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM1_HSEN(value)         (CFG_CFGCON1_SCOM1_HSEN_Msk & ((value) << CFG_CFGCON1_SCOM1_HSEN_Pos))
#define CFG_CFGCON1_SCOM2_HSEN_Pos            _U_(19)                                              /**< (CFG_CFGCON1) SERCOM2 (Direct)High Speed Pin Enable Position */
#define CFG_CFGCON1_SCOM2_HSEN_Msk            (_U_(0x1) << CFG_CFGCON1_SCOM2_HSEN_Pos)             /**< (CFG_CFGCON1) SERCOM2 (Direct)High Speed Pin Enable Mask */
#define CFG_CFGCON1_SCOM2_HSEN(value)         (CFG_CFGCON1_SCOM2_HSEN_Msk & ((value) << CFG_CFGCON1_SCOM2_HSEN_Pos))
#define CFG_CFGCON1_CCL_OE_Pos                _U_(20)                                              /**< (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Position */
#define CFG_CFGCON1_CCL_OE_Msk                (_U_(0x1) << CFG_CFGCON1_CCL_OE_Pos)                 /**< (CFG_CFGCON1) CCL Pads (via PPS) Output Enable Mask */
#define CFG_CFGCON1_CCL_OE(value)             (CFG_CFGCON1_CCL_OE_Msk & ((value) << CFG_CFGCON1_CCL_OE_Pos))
#define CFG_CFGCON1_I2CDSEL0_Pos              _U_(21)                                              /**< (CFG_CFGCON1) I2C Delay Select for SERCOM0 Position */
#define CFG_CFGCON1_I2CDSEL0_Msk              (_U_(0x1) << CFG_CFGCON1_I2CDSEL0_Pos)               /**< (CFG_CFGCON1) I2C Delay Select for SERCOM0 Mask */
#define CFG_CFGCON1_I2CDSEL0(value)           (CFG_CFGCON1_I2CDSEL0_Msk & ((value) << CFG_CFGCON1_I2CDSEL0_Pos))
#define CFG_CFGCON1_I2CDSEL1_Pos              _U_(22)                                              /**< (CFG_CFGCON1) I2C Delay Select for SERCOM1 Position */
#define CFG_CFGCON1_I2CDSEL1_Msk              (_U_(0x1) << CFG_CFGCON1_I2CDSEL1_Pos)               /**< (CFG_CFGCON1) I2C Delay Select for SERCOM1 Mask */
#define CFG_CFGCON1_I2CDSEL1(value)           (CFG_CFGCON1_I2CDSEL1_Msk & ((value) << CFG_CFGCON1_I2CDSEL1_Pos))
#define CFG_CFGCON1_I2CDSEL2_Pos              _U_(23)                                              /**< (CFG_CFGCON1) I2C Delay Select for SERCOM2 Position */
#define CFG_CFGCON1_I2CDSEL2_Msk              (_U_(0x1) << CFG_CFGCON1_I2CDSEL2_Pos)               /**< (CFG_CFGCON1) I2C Delay Select for SERCOM2 Mask */
#define CFG_CFGCON1_I2CDSEL2(value)           (CFG_CFGCON1_I2CDSEL2_Msk & ((value) << CFG_CFGCON1_I2CDSEL2_Pos))
#define CFG_CFGCON1_WDTPSS_Pos                _U_(24)                                              /**< (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Position */
#define CFG_CFGCON1_WDTPSS_Msk                (_U_(0x1F) << CFG_CFGCON1_WDTPSS_Pos)                /**< (CFG_CFGCON1) Watchdog Timer Post-scale Select Sleep Mask */
#define CFG_CFGCON1_WDTPSS(value)             (CFG_CFGCON1_WDTPSS_Msk & ((value) << CFG_CFGCON1_WDTPSS_Pos))
#define CFG_CFGCON1_QSPIDDRM_Pos              _U_(29)                                              /**< (CFG_CFGCON1) QSPI DDR Mode Clock Enable Position */
#define CFG_CFGCON1_QSPIDDRM_Msk              (_U_(0x1) << CFG_CFGCON1_QSPIDDRM_Pos)               /**< (CFG_CFGCON1) QSPI DDR Mode Clock Enable Mask */
#define CFG_CFGCON1_QSPIDDRM(value)           (CFG_CFGCON1_QSPIDDRM_Msk & ((value) << CFG_CFGCON1_QSPIDDRM_Pos))
#define CFG_CFGCON1_CLKZBREF_Pos              _U_(30)                                              /**< (CFG_CFGCON1) External Reference Clock ZB Enable Position */
#define CFG_CFGCON1_CLKZBREF_Msk              (_U_(0x1) << CFG_CFGCON1_CLKZBREF_Pos)               /**< (CFG_CFGCON1) External Reference Clock ZB Enable Mask */
#define CFG_CFGCON1_CLKZBREF(value)           (CFG_CFGCON1_CLKZBREF_Msk & ((value) << CFG_CFGCON1_CLKZBREF_Pos))
#define CFG_CFGCON1_Msk                       _U_(0x7FFFFFBB)                                      /**< (CFG_CFGCON1) Register Mask  */

#define CFG_CFGCON1_SLRCTRL_Pos               _U_(11)                                              /**< (CFG_CFGCON1 Position) I2C Slew Rate Control for SERCOMx */
#define CFG_CFGCON1_SLRCTRL_Msk               (_U_(0x7) << CFG_CFGCON1_SLRCTRL_Pos)                /**< (CFG_CFGCON1 Mask) SLRCTRL */
#define CFG_CFGCON1_SLRCTRL(value)            (CFG_CFGCON1_SLRCTRL_Msk & ((value) << CFG_CFGCON1_SLRCTRL_Pos)) 
#define CFG_CFGCON1_I2CDSEL_Pos               _U_(21)                                              /**< (CFG_CFGCON1 Position) I2C Delay Select for SERCOMx */
#define CFG_CFGCON1_I2CDSEL_Msk               (_U_(0x7) << CFG_CFGCON1_I2CDSEL_Pos)                /**< (CFG_CFGCON1 Mask) I2CDSEL */
#define CFG_CFGCON1_I2CDSEL(value)            (CFG_CFGCON1_I2CDSEL_Msk & ((value) << CFG_CFGCON1_I2CDSEL_Pos)) 

/* -------- CFG_CFGCON2 : (CFG Offset: 0x20) (R/W 32)  -------- */
#define CFG_CFGCON2_RESETVALUE                _U_(0x7F7FFF38)                                      /**<  (CFG_CFGCON2)   Reset Value */

#define CFG_CFGCON2_ACMP_CYCLE_Pos            _U_(0)                                               /**< (CFG_CFGCON2) AC SIB Comparator Result Wait Cycles Position */
#define CFG_CFGCON2_ACMP_CYCLE_Msk            (_U_(0x7) << CFG_CFGCON2_ACMP_CYCLE_Pos)             /**< (CFG_CFGCON2) AC SIB Comparator Result Wait Cycles Mask */
#define CFG_CFGCON2_ACMP_CYCLE(value)         (CFG_CFGCON2_ACMP_CYCLE_Msk & ((value) << CFG_CFGCON2_ACMP_CYCLE_Pos))
#define CFG_CFGCON2_DMTINTV_Pos               _U_(3)                                               /**< (CFG_CFGCON2) Dead Man Timer Count Window Interval Position */
#define CFG_CFGCON2_DMTINTV_Msk               (_U_(0x7) << CFG_CFGCON2_DMTINTV_Pos)                /**< (CFG_CFGCON2) Dead Man Timer Count Window Interval Mask */
#define CFG_CFGCON2_DMTINTV(value)            (CFG_CFGCON2_DMTINTV_Msk & ((value) << CFG_CFGCON2_DMTINTV_Pos))
#define CFG_CFGCON2_PMUTEST_VDD_EN_Pos        _U_(7)                                               /**< (CFG_CFGCON2) PMU Test Output or VDD/2 Enable via ADC IE12 Position */
#define CFG_CFGCON2_PMUTEST_VDD_EN_Msk        (_U_(0x1) << CFG_CFGCON2_PMUTEST_VDD_EN_Pos)         /**< (CFG_CFGCON2) PMU Test Output or VDD/2 Enable via ADC IE12 Mask */
#define CFG_CFGCON2_PMUTEST_VDD_EN(value)     (CFG_CFGCON2_PMUTEST_VDD_EN_Msk & ((value) << CFG_CFGCON2_PMUTEST_VDD_EN_Pos))
#define CFG_CFGCON2_POSCMOD_Pos               _U_(8)                                               /**< (CFG_CFGCON2) Primary Oscillator Configuration Position */
#define CFG_CFGCON2_POSCMOD_Msk               (_U_(0x3) << CFG_CFGCON2_POSCMOD_Pos)                /**< (CFG_CFGCON2) Primary Oscillator Configuration Mask */
#define CFG_CFGCON2_POSCMOD(value)            (CFG_CFGCON2_POSCMOD_Msk & ((value) << CFG_CFGCON2_POSCMOD_Pos))
#define CFG_CFGCON2_WDTRMCS_Pos               _U_(10)                                              /**< (CFG_CFGCON2) WDT RUN Mode Clock Select Position */
#define CFG_CFGCON2_WDTRMCS_Msk               (_U_(0x3) << CFG_CFGCON2_WDTRMCS_Pos)                /**< (CFG_CFGCON2) WDT RUN Mode Clock Select Mask */
#define CFG_CFGCON2_WDTRMCS(value)            (CFG_CFGCON2_WDTRMCS_Msk & ((value) << CFG_CFGCON2_WDTRMCS_Pos))
#define CFG_CFGCON2_SOSCSEL_Pos               _U_(12)                                              /**< (CFG_CFGCON2) SOSC Selection Configuration Position */
#define CFG_CFGCON2_SOSCSEL_Msk               (_U_(0x1) << CFG_CFGCON2_SOSCSEL_Pos)                /**< (CFG_CFGCON2) SOSC Selection Configuration Mask */
#define CFG_CFGCON2_SOSCSEL(value)            (CFG_CFGCON2_SOSCSEL_Msk & ((value) << CFG_CFGCON2_SOSCSEL_Pos))
#define CFG_CFGCON2_WAKE2SPD_Pos              _U_(13)                                              /**< (CFG_CFGCON2) 2-Speed startup enabled in Sleep mode Position */
#define CFG_CFGCON2_WAKE2SPD_Msk              (_U_(0x1) << CFG_CFGCON2_WAKE2SPD_Pos)               /**< (CFG_CFGCON2) 2-Speed startup enabled in Sleep mode Mask */
#define CFG_CFGCON2_WAKE2SPD(value)           (CFG_CFGCON2_WAKE2SPD_Msk & ((value) << CFG_CFGCON2_WAKE2SPD_Pos))
#define CFG_CFGCON2_CKSWEN_Pos                _U_(14)                                              /**< (CFG_CFGCON2) Software Clock Switching Enable Position */
#define CFG_CFGCON2_CKSWEN_Msk                (_U_(0x1) << CFG_CFGCON2_CKSWEN_Pos)                 /**< (CFG_CFGCON2) Software Clock Switching Enable Mask */
#define CFG_CFGCON2_CKSWEN(value)             (CFG_CFGCON2_CKSWEN_Msk & ((value) << CFG_CFGCON2_CKSWEN_Pos))
#define CFG_CFGCON2_FSCMEN_Pos                _U_(15)                                              /**< (CFG_CFGCON2) Fail-Safe Clock Monitor Enable Position */
#define CFG_CFGCON2_FSCMEN_Msk                (_U_(0x1) << CFG_CFGCON2_FSCMEN_Pos)                 /**< (CFG_CFGCON2) Fail-Safe Clock Monitor Enable Mask */
#define CFG_CFGCON2_FSCMEN(value)             (CFG_CFGCON2_FSCMEN_Msk & ((value) << CFG_CFGCON2_FSCMEN_Pos))
#define CFG_CFGCON2_WDTPSR_Pos                _U_(16)                                              /**< (CFG_CFGCON2) Watchdog Timer Post-scale Select Run Position */
#define CFG_CFGCON2_WDTPSR_Msk                (_U_(0x1F) << CFG_CFGCON2_WDTPSR_Pos)                /**< (CFG_CFGCON2) Watchdog Timer Post-scale Select Run Mask */
#define CFG_CFGCON2_WDTPSR(value)             (CFG_CFGCON2_WDTPSR_Msk & ((value) << CFG_CFGCON2_WDTPSR_Pos))
#define CFG_CFGCON2_WDTSPGM_Pos               _U_(21)                                              /**< (CFG_CFGCON2) Watchdog Timer Stop during Flash Programming Position */
#define CFG_CFGCON2_WDTSPGM_Msk               (_U_(0x1) << CFG_CFGCON2_WDTSPGM_Pos)                /**< (CFG_CFGCON2) Watchdog Timer Stop during Flash Programming Mask */
#define CFG_CFGCON2_WDTSPGM(value)            (CFG_CFGCON2_WDTSPGM_Msk & ((value) << CFG_CFGCON2_WDTSPGM_Pos))
#define CFG_CFGCON2_WINDIS_Pos                _U_(22)                                              /**< (CFG_CFGCON2) Windowed Watchdog Timer Disable Position */
#define CFG_CFGCON2_WINDIS_Msk                (_U_(0x1) << CFG_CFGCON2_WINDIS_Pos)                 /**< (CFG_CFGCON2) Windowed Watchdog Timer Disable Mask */
#define CFG_CFGCON2_WINDIS(value)             (CFG_CFGCON2_WINDIS_Msk & ((value) << CFG_CFGCON2_WINDIS_Pos))
#define CFG_CFGCON2_WDTEN_Pos                 _U_(23)                                              /**< (CFG_CFGCON2) Watchdog Timer Enable Position */
#define CFG_CFGCON2_WDTEN_Msk                 (_U_(0x1) << CFG_CFGCON2_WDTEN_Pos)                  /**< (CFG_CFGCON2) Watchdog Timer Enable Mask */
#define CFG_CFGCON2_WDTEN(value)              (CFG_CFGCON2_WDTEN_Msk & ((value) << CFG_CFGCON2_WDTEN_Pos))
#define CFG_CFGCON2_WDTWINSZ_Pos              _U_(24)                                              /**< (CFG_CFGCON2) Watchdog Timer Window Size Position */
#define CFG_CFGCON2_WDTWINSZ_Msk              (_U_(0x3) << CFG_CFGCON2_WDTWINSZ_Pos)               /**< (CFG_CFGCON2) Watchdog Timer Window Size Mask */
#define CFG_CFGCON2_WDTWINSZ(value)           (CFG_CFGCON2_WDTWINSZ_Msk & ((value) << CFG_CFGCON2_WDTWINSZ_Pos))
#define CFG_CFGCON2_DMTCNT_Pos                _U_(26)                                              /**< (CFG_CFGCON2) Dead Man Timer Count Select Position */
#define CFG_CFGCON2_DMTCNT_Msk                (_U_(0x1F) << CFG_CFGCON2_DMTCNT_Pos)                /**< (CFG_CFGCON2) Dead Man Timer Count Select Mask */
#define CFG_CFGCON2_DMTCNT(value)             (CFG_CFGCON2_DMTCNT_Msk & ((value) << CFG_CFGCON2_DMTCNT_Pos))
#define CFG_CFGCON2_DMTEN_Pos                 _U_(31)                                              /**< (CFG_CFGCON2) Dead Man Timer Enable Position */
#define CFG_CFGCON2_DMTEN_Msk                 (_U_(0x1) << CFG_CFGCON2_DMTEN_Pos)                  /**< (CFG_CFGCON2) Dead Man Timer Enable Mask */
#define CFG_CFGCON2_DMTEN(value)              (CFG_CFGCON2_DMTEN_Msk & ((value) << CFG_CFGCON2_DMTEN_Pos))
#define CFG_CFGCON2_Msk                       _U_(0xFFFFFFBF)                                      /**< (CFG_CFGCON2) Register Mask  */


/* -------- CFG_CFGCON4 : (CFG Offset: 0x40) (R/W 32)  -------- */
#define CFG_CFGCON4_RESETVALUE                _U_(0x840E4000)                                      /**<  (CFG_CFGCON4)   Reset Value */

