Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
#define CFG_CFGCON4_SOSCCFG_Pos               _U_(0)                                               /**< (CFG_CFGCON4) SOSC Configuration Position */
#define CFG_CFGCON4_SOSCCFG_Msk               (_U_(0xFF) << CFG_CFGCON4_SOSCCFG_Pos)               /**< (CFG_CFGCON4) SOSC Configuration Mask */
#define CFG_CFGCON4_SOSCCFG(value)            (CFG_CFGCON4_SOSCCFG_Msk & ((value) << CFG_CFGCON4_SOSCCFG_Pos))
#define CFG_CFGCON4_RTCEVENT_SEL_Pos          _U_(8)                                               /**< (CFG_CFGCON4) RTC Event Selection Position */
#define CFG_CFGCON4_RTCEVENT_SEL_Msk          (_U_(0x3) << CFG_CFGCON4_RTCEVENT_SEL_Pos)           /**< (CFG_CFGCON4) RTC Event Selection Mask */
#define CFG_CFGCON4_RTCEVENT_SEL(value)       (CFG_CFGCON4_RTCEVENT_SEL_Msk & ((value) << CFG_CFGCON4_RTCEVENT_SEL_Pos))
#define CFG_CFGCON4_RTCEVENT_EN_Pos           _U_(10)                                              /**< (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Position */
#define CFG_CFGCON4_RTCEVENT_EN_Msk           (_U_(0x1) << CFG_CFGCON4_RTCEVENT_EN_Pos)            /**< (CFG_CFGCON4) Pad Output Enable for MCHP legacy RTC event output Mask */
#define CFG_CFGCON4_RTCEVENT_EN(value)        (CFG_CFGCON4_RTCEVENT_EN_Msk & ((value) << CFG_CFGCON4_RTCEVENT_EN_Pos))
#define CFG_CFGCON4_VBKP_1KCSEL_Pos           _U_(11)                                              /**< (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Position */
#define CFG_CFGCON4_VBKP_1KCSEL_Msk           (_U_(0x1) << CFG_CFGCON4_VBKP_1KCSEL_Pos)            /**< (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Selection Mask */
#define CFG_CFGCON4_VBKP_1KCSEL(value)        (CFG_CFGCON4_VBKP_1KCSEL_Msk & ((value) << CFG_CFGCON4_VBKP_1KCSEL_Pos))
#define CFG_CFGCON4_VBKP_32KCSEL_Pos          _U_(12)                                              /**< (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Position */
#define CFG_CFGCON4_VBKP_32KCSEL_Msk          (_U_(0x3) << CFG_CFGCON4_VBKP_32KCSEL_Pos)           /**< (CFG_CFGCON4) VDDBUKPCORE 32KHz clock source selection Mask */
#define CFG_CFGCON4_VBKP_32KCSEL(value)       (CFG_CFGCON4_VBKP_32KCSEL_Msk & ((value) << CFG_CFGCON4_VBKP_32KCSEL_Pos))
#define CFG_CFGCON4_VBKP_DIVSEL_Pos           _U_(14)                                              /**< (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Position */
#define CFG_CFGCON4_VBKP_DIVSEL_Msk           (_U_(0x1) << CFG_CFGCON4_VBKP_DIVSEL_Pos)            /**< (CFG_CFGCON4) VDDBUKPCORE LPCLK Clock Divider Selection Mask */
#define CFG_CFGCON4_VBKP_DIVSEL(value)        (CFG_CFGCON4_VBKP_DIVSEL_Msk & ((value) << CFG_CFGCON4_VBKP_DIVSEL_Pos))
#define CFG_CFGCON4_LPCLK_MOD_Pos             _U_(15)                                              /**< (CFG_CFGCON4) LPCLK modifier in counter/delay mode Position */
#define CFG_CFGCON4_LPCLK_MOD_Msk             (_U_(0x1) << CFG_CFGCON4_LPCLK_MOD_Pos)              /**< (CFG_CFGCON4) LPCLK modifier in counter/delay mode Mask */
#define CFG_CFGCON4_LPCLK_MOD(value)          (CFG_CFGCON4_LPCLK_MOD_Msk & ((value) << CFG_CFGCON4_LPCLK_MOD_Pos))
#define CFG_CFGCON4_RTCEFTYPE_Pos             _U_(16)                                              /**< (CFG_CFGCON4) RTC Event Type Position */
#define CFG_CFGCON4_RTCEFTYPE_Msk             (_U_(0x1) << CFG_CFGCON4_RTCEFTYPE_Pos)              /**< (CFG_CFGCON4) RTC Event Type Mask */
#define CFG_CFGCON4_RTCEFTYPE(value)          (CFG_CFGCON4_RTCEFTYPE_Msk & ((value) << CFG_CFGCON4_RTCEFTYPE_Pos))
#define CFG_CFGCON4_CPEN_DLY_Pos              _U_(17)                                              /**< (CFG_CFGCON4) Charge-pump ready digital delay Position */
#define CFG_CFGCON4_CPEN_DLY_Msk              (_U_(0x7) << CFG_CFGCON4_CPEN_DLY_Pos)               /**< (CFG_CFGCON4) Charge-pump ready digital delay Mask */
#define CFG_CFGCON4_CPEN_DLY(value)           (CFG_CFGCON4_CPEN_DLY_Msk & ((value) << CFG_CFGCON4_CPEN_DLY_Pos))
#define CFG_CFGCON4_DSZPBOREN_Pos             _U_(20)                                              /**< (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Position */
#define CFG_CFGCON4_DSZPBOREN_Msk             (_U_(0x1) << CFG_CFGCON4_DSZPBOREN_Pos)              /**< (CFG_CFGCON4) Deep Sleep Zero-Power BOR Enable Mask */
#define CFG_CFGCON4_DSZPBOREN(value)          (CFG_CFGCON4_DSZPBOREN_Msk & ((value) << CFG_CFGCON4_DSZPBOREN_Pos))
#define CFG_CFGCON4_DSWDTPS_Pos               _U_(21)                                              /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Position */
#define CFG_CFGCON4_DSWDTPS_Msk               (_U_(0x1F) << CFG_CFGCON4_DSWDTPS_Pos)               /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Postscale Select Mask */
#define CFG_CFGCON4_DSWDTPS(value)            (CFG_CFGCON4_DSWDTPS_Msk & ((value) << CFG_CFGCON4_DSWDTPS_Pos))
#define CFG_CFGCON4_DSWDTOSC_Pos              _U_(26)                                              /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Position */
#define CFG_CFGCON4_DSWDTOSC_Msk              (_U_(0x1) << CFG_CFGCON4_DSWDTOSC_Pos)               /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Reference Clock Select Mask */
#define CFG_CFGCON4_DSWDTOSC(value)           (CFG_CFGCON4_DSWDTOSC_Msk & ((value) << CFG_CFGCON4_DSWDTOSC_Pos))
#define CFG_CFGCON4_DSWDTEN_Pos               _U_(27)                                              /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Position */
#define CFG_CFGCON4_DSWDTEN_Msk               (_U_(0x1) << CFG_CFGCON4_DSWDTEN_Pos)                /**< (CFG_CFGCON4) Deep Sleep Watchdog Timer Enable Mask */
#define CFG_CFGCON4_DSWDTEN(value)            (CFG_CFGCON4_DSWDTEN_Msk & ((value) << CFG_CFGCON4_DSWDTEN_Pos))
#define CFG_CFGCON4_DSEN_Pos                  _U_(28)                                              /**< (CFG_CFGCON4) Deep Sleep Bit Enable Position */
#define CFG_CFGCON4_DSEN_Msk                  (_U_(0x1) << CFG_CFGCON4_DSEN_Pos)                   /**< (CFG_CFGCON4) Deep Sleep Bit Enable Mask */
#define CFG_CFGCON4_DSEN(value)               (CFG_CFGCON4_DSEN_Msk & ((value) << CFG_CFGCON4_DSEN_Pos))
#define CFG_CFGCON4_UVREGROVR_Pos             _U_(29)                                              /**< (CFG_CFGCON4) ULPVREG Retention Mode Override Position */
#define CFG_CFGCON4_UVREGROVR_Msk             (_U_(0x1) << CFG_CFGCON4_UVREGROVR_Pos)              /**< (CFG_CFGCON4) ULPVREG Retention Mode Override Mask */
#define CFG_CFGCON4_UVREGROVR(value)          (CFG_CFGCON4_UVREGROVR_Msk & ((value) << CFG_CFGCON4_UVREGROVR_Pos))
#define CFG_CFGCON4_LPOSCEN_Pos               _U_(30)                                              /**< (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Position */
#define CFG_CFGCON4_LPOSCEN_Msk               (_U_(0x1) << CFG_CFGCON4_LPOSCEN_Pos)                /**< (CFG_CFGCON4) Low Power (Secondary) Oscillator Enable Mask */
#define CFG_CFGCON4_LPOSCEN(value)            (CFG_CFGCON4_LPOSCEN_Msk & ((value) << CFG_CFGCON4_LPOSCEN_Pos))
#define CFG_CFGCON4_RTCNTM_CSEL_Pos           _U_(31)                                              /**< (CFG_CFGCON4) RTC Counter Mode Clock Select Position */
#define CFG_CFGCON4_RTCNTM_CSEL_Msk           (_U_(0x1) << CFG_CFGCON4_RTCNTM_CSEL_Pos)            /**< (CFG_CFGCON4) RTC Counter Mode Clock Select Mask */
#define CFG_CFGCON4_RTCNTM_CSEL(value)        (CFG_CFGCON4_RTCNTM_CSEL_Msk & ((value) << CFG_CFGCON4_RTCNTM_CSEL_Pos))
#define CFG_CFGCON4_Msk                       _U_(0xFFFFFFFF)                                      /**< (CFG_CFGCON4) Register Mask  */


/* -------- CFG_CFGPGQOS : (CFG Offset: 0x50) (R/W 32)  -------- */
#define CFG_CFGPGQOS_RESETVALUE               _U_(0xE040004C)                                      /**<  (CFG_CFGPGQOS)   Reset Value */

