Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
#define CFG_CFGPGQOS_CPUPG_Pos                _U_(0)                                               /**< (CFG_CFGPGQOS) CPU (Code) Permission Group Position */
#define CFG_CFGPGQOS_CPUPG_Msk                (_U_(0x3) << CFG_CFGPGQOS_CPUPG_Pos)                 /**< (CFG_CFGPGQOS) CPU (Code) Permission Group Mask */
#define CFG_CFGPGQOS_CPUPG(value)             (CFG_CFGPGQOS_CPUPG_Msk & ((value) << CFG_CFGPGQOS_CPUPG_Pos))
#define CFG_CFGPGQOS_CPUQOS_Pos               _U_(2)                                               /**< (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Position */
#define CFG_CFGPGQOS_CPUQOS_Msk               (_U_(0x3) << CFG_CFGPGQOS_CPUQOS_Pos)                /**< (CFG_CFGPGQOS) CPU I/D and System Bus QOS Control Mask */
#define CFG_CFGPGQOS_CPUQOS(value)            (CFG_CFGPGQOS_CPUQOS_Msk & ((value) << CFG_CFGPGQOS_CPUQOS_Pos))
#define CFG_CFGPGQOS_ICDJPG_Pos               _U_(4)                                               /**< (CFG_CFGPGQOS) ICD-JTAG Permission Group Position */
#define CFG_CFGPGQOS_ICDJPG_Msk               (_U_(0x3) << CFG_CFGPGQOS_ICDJPG_Pos)                /**< (CFG_CFGPGQOS) ICD-JTAG Permission Group Mask */
#define CFG_CFGPGQOS_ICDJPG(value)            (CFG_CFGPGQOS_ICDJPG_Msk & ((value) << CFG_CFGPGQOS_ICDJPG_Pos))
#define CFG_CFGPGQOS_ICDJQOS_Pos              _U_(6)                                               /**< (CFG_CFGPGQOS) ICD-JTAG Bus QOS Control Position */
#define CFG_CFGPGQOS_ICDJQOS_Msk              (_U_(0x3) << CFG_CFGPGQOS_ICDJQOS_Pos)               /**< (CFG_CFGPGQOS) ICD-JTAG Bus QOS Control Mask */
#define CFG_CFGPGQOS_ICDJQOS(value)           (CFG_CFGPGQOS_ICDJQOS_Msk & ((value) << CFG_CFGPGQOS_ICDJQOS_Pos))
#define CFG_CFGPGQOS_DMAPG_Pos                _U_(8)                                               /**< (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Position */
#define CFG_CFGPGQOS_DMAPG_Msk                (_U_(0x3) << CFG_CFGPGQOS_DMAPG_Pos)                 /**< (CFG_CFGPGQOS) DMA (Rd/Wr) Permission Group Mask */
#define CFG_CFGPGQOS_DMAPG(value)             (CFG_CFGPGQOS_DMAPG_Msk & ((value) << CFG_CFGPGQOS_DMAPG_Pos))
#define CFG_CFGPGQOS_ADCPG_Pos                _U_(16)                                              /**< (CFG_CFGPGQOS) ADC Controller Permission Group Position */
#define CFG_CFGPGQOS_ADCPG_Msk                (_U_(0x3) << CFG_CFGPGQOS_ADCPG_Pos)                 /**< (CFG_CFGPGQOS) ADC Controller Permission Group Mask */
#define CFG_CFGPGQOS_ADCPG(value)             (CFG_CFGPGQOS_ADCPG_Msk & ((value) << CFG_CFGPGQOS_ADCPG_Pos))
#define CFG_CFGPGQOS_ADCQOS_Pos               _U_(18)                                              /**< (CFG_CFGPGQOS) ADC Controller QOS Control Position */
#define CFG_CFGPGQOS_ADCQOS_Msk               (_U_(0x3) << CFG_CFGPGQOS_ADCQOS_Pos)                /**< (CFG_CFGPGQOS) ADC Controller QOS Control Mask */
#define CFG_CFGPGQOS_ADCQOS(value)            (CFG_CFGPGQOS_ADCQOS_Msk & ((value) << CFG_CFGPGQOS_ADCQOS_Pos))
#define CFG_CFGPGQOS_ICMPG_Pos                _U_(20)                                              /**< (CFG_CFGPGQOS) ICM Permission Group Position */
#define CFG_CFGPGQOS_ICMPG_Msk                (_U_(0x3) << CFG_CFGPGQOS_ICMPG_Pos)                 /**< (CFG_CFGPGQOS) ICM Permission Group Mask */
#define CFG_CFGPGQOS_ICMPG(value)             (CFG_CFGPGQOS_ICMPG_Msk & ((value) << CFG_CFGPGQOS_ICMPG_Pos))
#define CFG_CFGPGQOS_ICMQOS_Pos               _U_(22)                                              /**< (CFG_CFGPGQOS) ICM QOS Control Position */
#define CFG_CFGPGQOS_ICMQOS_Msk               (_U_(0x3) << CFG_CFGPGQOS_ICMQOS_Pos)                /**< (CFG_CFGPGQOS) ICM QOS Control Mask */
#define CFG_CFGPGQOS_ICMQOS(value)            (CFG_CFGPGQOS_ICMQOS_Msk & ((value) << CFG_CFGPGQOS_ICMQOS_Pos))
#define CFG_CFGPGQOS_DSUPG_Pos                _U_(24)                                              /**< (CFG_CFGPGQOS) DSU Permission Group Position */
#define CFG_CFGPGQOS_DSUPG_Msk                (_U_(0x3) << CFG_CFGPGQOS_DSUPG_Pos)                 /**< (CFG_CFGPGQOS) DSU Permission Group Mask */
#define CFG_CFGPGQOS_DSUPG(value)             (CFG_CFGPGQOS_DSUPG_Msk & ((value) << CFG_CFGPGQOS_DSUPG_Pos))
#define CFG_CFGPGQOS_FCQOS_Pos                _U_(28)                                              /**< (CFG_CFGPGQOS) FC Controller QOS Control Position */
#define CFG_CFGPGQOS_FCQOS_Msk                (_U_(0x3) << CFG_CFGPGQOS_FCQOS_Pos)                 /**< (CFG_CFGPGQOS) FC Controller QOS Control Mask */
#define CFG_CFGPGQOS_FCQOS(value)             (CFG_CFGPGQOS_FCQOS_Msk & ((value) << CFG_CFGPGQOS_FCQOS_Pos))
#define CFG_CFGPGQOS_WISIBQOS_Pos             _U_(30)                                              /**< (CFG_CFGPGQOS) Wireless SIB QOS Control Position */
#define CFG_CFGPGQOS_WISIBQOS_Msk             (_U_(0x3) << CFG_CFGPGQOS_WISIBQOS_Pos)              /**< (CFG_CFGPGQOS) Wireless SIB QOS Control Mask */
#define CFG_CFGPGQOS_WISIBQOS(value)          (CFG_CFGPGQOS_WISIBQOS_Msk & ((value) << CFG_CFGPGQOS_WISIBQOS_Pos))
#define CFG_CFGPGQOS_Msk                      _U_(0xF3FF03FF)                                      /**< (CFG_CFGPGQOS) Register Mask  */


/* -------- CFG_CFGPCLKGEN1 : (CFG Offset: 0x60) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN1_RESETVALUE            _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN1)   Reset Value */

#define CFG_CFGPCLKGEN1_EICCSEL_Pos           _U_(0)                                               /**< (CFG_CFGPCLKGEN1) EIC Clock Selection Position */
#define CFG_CFGPCLKGEN1_EICCSEL_Msk           (_U_(0x7) << CFG_CFGPCLKGEN1_EICCSEL_Pos)            /**< (CFG_CFGPCLKGEN1) EIC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_EICCSEL(value)        (CFG_CFGPCLKGEN1_EICCSEL_Msk & ((value) << CFG_CFGPCLKGEN1_EICCSEL_Pos))
#define   CFG_CFGPCLKGEN1_EICCSEL_NO_CLK_Val  _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO1_Val   _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO2_Val   _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO3_Val   _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO4_Val   _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO5_Val   _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_EICCSEL_REFO6_Val   _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_EICCSEL_LPCLK_Val   _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_EICCSEL_NO_CLK        (CFG_CFGPCLKGEN1_EICCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO1         (CFG_CFGPCLKGEN1_EICCSEL_REFO1_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO2         (CFG_CFGPCLKGEN1_EICCSEL_REFO2_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO3         (CFG_CFGPCLKGEN1_EICCSEL_REFO3_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO4         (CFG_CFGPCLKGEN1_EICCSEL_REFO4_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO5         (CFG_CFGPCLKGEN1_EICCSEL_REFO5_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_REFO6         (CFG_CFGPCLKGEN1_EICCSEL_REFO6_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_EICCSEL_LPCLK         (CFG_CFGPCLKGEN1_EICCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_EICCSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_EICCD_Pos             _U_(3)                                               /**< (CFG_CFGPCLKGEN1) EIC Clock Disable Position */
#define CFG_CFGPCLKGEN1_EICCD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN1_EICCD_Pos)              /**< (CFG_CFGPCLKGEN1) EIC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_EICCD(value)          (CFG_CFGPCLKGEN1_EICCD_Msk & ((value) << CFG_CFGPCLKGEN1_EICCD_Pos))
#define   CFG_CFGPCLKGEN1_EICCD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_EICCD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_EICCD_ON              (CFG_CFGPCLKGEN1_EICCD_ON_Val << CFG_CFGPCLKGEN1_EICCD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_EICCD_OFF             (CFG_CFGPCLKGEN1_EICCD_OFF_Val << CFG_CFGPCLKGEN1_EICCD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_Pos        _U_(4)                                               /**< (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_Msk        (_U_(0x7) << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos)         /**< (CFG_CFGPCLKGEN1) FREQMRC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQMRCSEL(value)     (CFG_CFGPCLKGEN1_FREQMRCSEL_Msk & ((value) << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos))
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK     (CFG_CFGPCLKGEN1_FREQMRCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6      (CFG_CFGPCLKGEN1_FREQMRCSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK      (CFG_CFGPCLKGEN1_FREQMRCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQMRCSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_RCD_Pos               _U_(7)                                               /**< (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Position */
#define CFG_CFGPCLKGEN1_RCD_Msk               (_U_(0x1) << CFG_CFGPCLKGEN1_RCD_Pos)                /**< (CFG_CFGPCLKGEN1) FREQMRC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_RCD(value)            (CFG_CFGPCLKGEN1_RCD_Msk & ((value) << CFG_CFGPCLKGEN1_RCD_Pos))
#define   CFG_CFGPCLKGEN1_RCD_ON_Val          _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_RCD_OFF_Val         _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_RCD_ON                (CFG_CFGPCLKGEN1_RCD_ON_Val << CFG_CFGPCLKGEN1_RCD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_RCD_OFF               (CFG_CFGPCLKGEN1_RCD_OFF_Val << CFG_CFGPCLKGEN1_RCD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_Pos        _U_(8)                                               /**< (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Position */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_Msk        (_U_(0x7) << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos)         /**< (CFG_CFGPCLKGEN1) FREQMMC Clock Selection Mask */
#define CFG_CFGPCLKGEN1_FREQMMCSEL(value)     (CFG_CFGPCLKGEN1_FREQMMCSEL_Msk & ((value) << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos))
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK     (CFG_CFGPCLKGEN1_FREQMMCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO1_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO2_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO3_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO4_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO5_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6      (CFG_CFGPCLKGEN1_FREQMMCSEL_REFO6_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK      (CFG_CFGPCLKGEN1_FREQMMCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_FREQMMCSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_MCD_Pos               _U_(11)                                              /**< (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Position */
#define CFG_CFGPCLKGEN1_MCD_Msk               (_U_(0x1) << CFG_CFGPCLKGEN1_MCD_Pos)                /**< (CFG_CFGPCLKGEN1) FREQMMC Clock Disable Mask */
#define CFG_CFGPCLKGEN1_MCD(value)            (CFG_CFGPCLKGEN1_MCD_Msk & ((value) << CFG_CFGPCLKGEN1_MCD_Pos))
#define   CFG_CFGPCLKGEN1_MCD_ON_Val          _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_MCD_OFF_Val         _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_MCD_ON                (CFG_CFGPCLKGEN1_MCD_ON_Val << CFG_CFGPCLKGEN1_MCD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_MCD_OFF               (CFG_CFGPCLKGEN1_MCD_OFF_Val << CFG_CFGPCLKGEN1_MCD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos      _U_(12)                                              /**< (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_Msk      (_U_(0x7) << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos)       /**< (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL(value)   (CFG_CFGPCLKGEN1_SERCOM01CSEL_Msk & ((value) << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos))
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK   (CFG_CFGPCLKGEN1_SERCOM01CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6    (CFG_CFGPCLKGEN1_SERCOM01CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK    (CFG_CFGPCLKGEN1_SERCOM01CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM01CSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_S01CD_Pos             _U_(15)                                              /**< (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Disable Position */
#define CFG_CFGPCLKGEN1_S01CD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN1_S01CD_Pos)              /**< (CFG_CFGPCLKGEN1) SERCOM0/1 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_S01CD(value)          (CFG_CFGPCLKGEN1_S01CD_Msk & ((value) << CFG_CFGPCLKGEN1_S01CD_Pos))
#define   CFG_CFGPCLKGEN1_S01CD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_S01CD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_S01CD_ON              (CFG_CFGPCLKGEN1_S01CD_ON_Val << CFG_CFGPCLKGEN1_S01CD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_S01CD_OFF             (CFG_CFGPCLKGEN1_S01CD_OFF_Val << CFG_CFGPCLKGEN1_S01CD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos      _U_(16)                                              /**< (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Selection Position */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_Msk      (_U_(0x7) << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos)       /**< (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL(value)   (CFG_CFGPCLKGEN1_SERCOM23CSEL_Msk & ((value) << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos))
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK   (CFG_CFGPCLKGEN1_SERCOM23CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO1_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO2_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO3_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO4_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO5_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
