Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6    (CFG_CFGPCLKGEN1_SERCOM23CSEL_REFO6_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK    (CFG_CFGPCLKGEN1_SERCOM23CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_SERCOM23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_S23CD_Pos             _U_(19)                                              /**< (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Disable Position */
#define CFG_CFGPCLKGEN1_S23CD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN1_S23CD_Pos)              /**< (CFG_CFGPCLKGEN1) SERCOM2/3 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_S23CD(value)          (CFG_CFGPCLKGEN1_S23CD_Msk & ((value) << CFG_CFGPCLKGEN1_S23CD_Pos))
#define   CFG_CFGPCLKGEN1_S23CD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_S23CD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_S23CD_ON              (CFG_CFGPCLKGEN1_S23CD_ON_Val << CFG_CFGPCLKGEN1_S23CD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_S23CD_OFF             (CFG_CFGPCLKGEN1_S23CD_OFF_Val << CFG_CFGPCLKGEN1_S23CD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_Pos         _U_(20)                                              /**< (CFG_CFGPCLKGEN1) TCC1/2 Clock Selection Position */
#define CFG_CFGPCLKGEN1_TCC12CSEL_Msk         (_U_(0x7) << CFG_CFGPCLKGEN1_TCC12CSEL_Pos)          /**< (CFG_CFGPCLKGEN1) TCC1/2 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_TCC12CSEL(value)      (CFG_CFGPCLKGEN1_TCC12CSEL_Msk & ((value) << CFG_CFGPCLKGEN1_TCC12CSEL_Pos))
#define   CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK      (CFG_CFGPCLKGEN1_TCC12CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO1       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO1_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO2       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO2_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO3       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO3_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO4       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO4_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO5       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO5_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_REFO6       (CFG_CFGPCLKGEN1_TCC12CSEL_REFO6_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK       (CFG_CFGPCLKGEN1_TCC12CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_TCC12CSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_TCC12CD_Pos           _U_(23)                                              /**< (CFG_CFGPCLKGEN1) TCC1/2 Clock Disable Position */
#define CFG_CFGPCLKGEN1_TCC12CD_Msk           (_U_(0x1) << CFG_CFGPCLKGEN1_TCC12CD_Pos)            /**< (CFG_CFGPCLKGEN1) TCC1/2 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_TCC12CD(value)        (CFG_CFGPCLKGEN1_TCC12CD_Msk & ((value) << CFG_CFGPCLKGEN1_TCC12CD_Pos))
#define   CFG_CFGPCLKGEN1_TCC12CD_ON_Val      _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_TCC12CD_OFF_Val     _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_TCC12CD_ON            (CFG_CFGPCLKGEN1_TCC12CD_ON_Val << CFG_CFGPCLKGEN1_TCC12CD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_TCC12CD_OFF           (CFG_CFGPCLKGEN1_TCC12CD_OFF_Val << CFG_CFGPCLKGEN1_TCC12CD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_Pos          _U_(24)                                              /**< (CFG_CFGPCLKGEN1) TC2/3 Clock Selection Position */
#define CFG_CFGPCLKGEN1_TC23CSEL_Msk          (_U_(0x7) << CFG_CFGPCLKGEN1_TC23CSEL_Pos)           /**< (CFG_CFGPCLKGEN1) TC2/3 Clock Selection Mask */
#define CFG_CFGPCLKGEN1_TC23CSEL(value)       (CFG_CFGPCLKGEN1_TC23CSEL_Msk & ((value) << CFG_CFGPCLKGEN1_TC23CSEL_Pos))
#define   CFG_CFGPCLKGEN1_TC23CSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO1_Val  _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO2_Val  _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO3_Val  _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO4_Val  _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO5_Val  _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_REFO6_Val  _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_TC23CSEL_LPCLK_Val  _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_TC23CSEL_NO_CLK       (CFG_CFGPCLKGEN1_TC23CSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO1        (CFG_CFGPCLKGEN1_TC23CSEL_REFO1_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO2        (CFG_CFGPCLKGEN1_TC23CSEL_REFO2_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO3        (CFG_CFGPCLKGEN1_TC23CSEL_REFO3_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO4        (CFG_CFGPCLKGEN1_TC23CSEL_REFO4_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO5        (CFG_CFGPCLKGEN1_TC23CSEL_REFO5_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_REFO6        (CFG_CFGPCLKGEN1_TC23CSEL_REFO6_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_TC23CSEL_LPCLK        (CFG_CFGPCLKGEN1_TC23CSEL_LPCLK_Val << CFG_CFGPCLKGEN1_TC23CSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_TC23CD_Pos            _U_(27)                                              /**< (CFG_CFGPCLKGEN1) TC2/3 Clock Disable Position */
#define CFG_CFGPCLKGEN1_TC23CD_Msk            (_U_(0x1) << CFG_CFGPCLKGEN1_TC23CD_Pos)             /**< (CFG_CFGPCLKGEN1) TC2/3 Clock Disable Mask */
#define CFG_CFGPCLKGEN1_TC23CD(value)         (CFG_CFGPCLKGEN1_TC23CD_Msk & ((value) << CFG_CFGPCLKGEN1_TC23CD_Pos))
#define   CFG_CFGPCLKGEN1_TC23CD_ON_Val       _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_TC23CD_OFF_Val      _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_TC23CD_ON             (CFG_CFGPCLKGEN1_TC23CD_ON_Val << CFG_CFGPCLKGEN1_TC23CD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_TC23CD_OFF            (CFG_CFGPCLKGEN1_TC23CD_OFF_Val << CFG_CFGPCLKGEN1_TC23CD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_Pos          _U_(28)                                              /**< (CFG_CFGPCLKGEN1) CM4T Clock Selection Position */
#define CFG_CFGPCLKGEN1_CM4TCSEL_Msk          (_U_(0x7) << CFG_CFGPCLKGEN1_CM4TCSEL_Pos)           /**< (CFG_CFGPCLKGEN1) CM4T Clock Selection Mask */
#define CFG_CFGPCLKGEN1_CM4TCSEL(value)       (CFG_CFGPCLKGEN1_CM4TCSEL_Msk & ((value) << CFG_CFGPCLKGEN1_CM4TCSEL_Pos))
#define   CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) No Clock  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO1_Val  _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 1  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO2_Val  _U_(0x2)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 2  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO3_Val  _U_(0x3)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 3  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO4_Val  _U_(0x4)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 4  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO5_Val  _U_(0x5)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 5  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_REFO6_Val  _U_(0x6)                                             /**< (CFG_CFGPCLKGEN1) Reference Clock 6  */
#define   CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK_Val  _U_(0x7)                                             /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK       (CFG_CFGPCLKGEN1_CM4TCSEL_NO_CLK_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) No Clock Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO1        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO1_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO2        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO2_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO3        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO3_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO4        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO4_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO5        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO5_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_REFO6        (CFG_CFGPCLKGEN1_CM4TCSEL_REFO6_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK        (CFG_CFGPCLKGEN1_CM4TCSEL_LPCLK_Val << CFG_CFGPCLKGEN1_CM4TCSEL_Pos) /**< (CFG_CFGPCLKGEN1) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN1_CM4TD_Pos             _U_(31)                                              /**< (CFG_CFGPCLKGEN1) CM4T Clock Disable Position */
#define CFG_CFGPCLKGEN1_CM4TD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN1_CM4TD_Pos)              /**< (CFG_CFGPCLKGEN1) CM4T Clock Disable Mask */
#define CFG_CFGPCLKGEN1_CM4TD(value)          (CFG_CFGPCLKGEN1_CM4TD_Msk & ((value) << CFG_CFGPCLKGEN1_CM4TD_Pos))
#define   CFG_CFGPCLKGEN1_CM4TD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN1) Enable PGCLK  */
#define   CFG_CFGPCLKGEN1_CM4TD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN1) Disable PGCLK  */
#define CFG_CFGPCLKGEN1_CM4TD_ON              (CFG_CFGPCLKGEN1_CM4TD_ON_Val << CFG_CFGPCLKGEN1_CM4TD_Pos) /**< (CFG_CFGPCLKGEN1) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN1_CM4TD_OFF             (CFG_CFGPCLKGEN1_CM4TD_OFF_Val << CFG_CFGPCLKGEN1_CM4TD_Pos) /**< (CFG_CFGPCLKGEN1) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN1_Msk                   _U_(0xFFFFFFFF)                                      /**< (CFG_CFGPCLKGEN1) Register Mask  */


/* -------- CFG_CFGPCLKGEN2 : (CFG Offset: 0x70) (R/W 32)  -------- */
#define CFG_CFGPCLKGEN2_RESETVALUE            _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN2)   Reset Value */

