Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos        _U_(0)                                               /**< (CFG_CFGPCLKGEN3) EVSYSC9 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_Msk        (_U_(0x7) << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos)         /**< (CFG_CFGPCLKGEN3) EVSYSC9 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL(value)     (CFG_CFGPCLKGEN3_EVSYSC9SEL_Msk & ((value) << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos))
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYSC9SEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_NO_CLK     (CFG_CFGPCLKGEN3_EVSYSC9SEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO1      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO2      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO3      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO4      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO5      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO6      (CFG_CFGPCLKGEN3_EVSYSC9SEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC9SEL_LPCLK      (CFG_CFGPCLKGEN3_EVSYSC9SEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYSC9SEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_C9D_Pos               _U_(3)                                               /**< (CFG_CFGPCLKGEN3) C9D Clock Disable Position */
#define CFG_CFGPCLKGEN3_C9D_Msk               (_U_(0x1) << CFG_CFGPCLKGEN3_C9D_Pos)                /**< (CFG_CFGPCLKGEN3) C9D Clock Disable Mask */
#define CFG_CFGPCLKGEN3_C9D(value)            (CFG_CFGPCLKGEN3_C9D_Msk & ((value) << CFG_CFGPCLKGEN3_C9D_Pos))
#define   CFG_CFGPCLKGEN3_C9D_ON_Val          _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_C9D_OFF_Val         _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_C9D_ON                (CFG_CFGPCLKGEN3_C9D_ON_Val << CFG_CFGPCLKGEN3_C9D_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_C9D_OFF               (CFG_CFGPCLKGEN3_C9D_OFF_Val << CFG_CFGPCLKGEN3_C9D_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos       _U_(4)                                               /**< (CFG_CFGPCLKGEN3) EVSYSC10 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_Msk       (_U_(0x7) << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos)        /**< (CFG_CFGPCLKGEN3) EVSYSC10 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL(value)    (CFG_CFGPCLKGEN3_EVSYSC10SEL_Msk & ((value) << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos))
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYSC10SEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_NO_CLK    (CFG_CFGPCLKGEN3_EVSYSC10SEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO1     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO2     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO3     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO4     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO5     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO6     (CFG_CFGPCLKGEN3_EVSYSC10SEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC10SEL_LPCLK     (CFG_CFGPCLKGEN3_EVSYSC10SEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYSC10SEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_C10D_Pos              _U_(7)                                               /**< (CFG_CFGPCLKGEN3) C10D Clock Disable Position */
#define CFG_CFGPCLKGEN3_C10D_Msk              (_U_(0x1) << CFG_CFGPCLKGEN3_C10D_Pos)               /**< (CFG_CFGPCLKGEN3) C10D Clock Disable Mask */
#define CFG_CFGPCLKGEN3_C10D(value)           (CFG_CFGPCLKGEN3_C10D_Msk & ((value) << CFG_CFGPCLKGEN3_C10D_Pos))
#define   CFG_CFGPCLKGEN3_C10D_ON_Val         _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_C10D_OFF_Val        _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_C10D_ON               (CFG_CFGPCLKGEN3_C10D_ON_Val << CFG_CFGPCLKGEN3_C10D_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_C10D_OFF              (CFG_CFGPCLKGEN3_C10D_OFF_Val << CFG_CFGPCLKGEN3_C10D_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos       _U_(8)                                               /**< (CFG_CFGPCLKGEN3) EVSYSC11 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_Msk       (_U_(0x7) << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos)        /**< (CFG_CFGPCLKGEN3) EVSYSC11 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL(value)    (CFG_CFGPCLKGEN3_EVSYSC11SEL_Msk & ((value) << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos))
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYSC11SEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_NO_CLK    (CFG_CFGPCLKGEN3_EVSYSC11SEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO1     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO2     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO3     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO4     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO5     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO6     (CFG_CFGPCLKGEN3_EVSYSC11SEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC11SEL_LPCLK     (CFG_CFGPCLKGEN3_EVSYSC11SEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYSC11SEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_C11D_Pos              _U_(11)                                              /**< (CFG_CFGPCLKGEN3) C11D Clock Disable Position */
#define CFG_CFGPCLKGEN3_C11D_Msk              (_U_(0x1) << CFG_CFGPCLKGEN3_C11D_Pos)               /**< (CFG_CFGPCLKGEN3) C11D Clock Disable Mask */
#define CFG_CFGPCLKGEN3_C11D(value)           (CFG_CFGPCLKGEN3_C11D_Msk & ((value) << CFG_CFGPCLKGEN3_C11D_Pos))
#define   CFG_CFGPCLKGEN3_C11D_ON_Val         _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_C11D_OFF_Val        _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_C11D_ON               (CFG_CFGPCLKGEN3_C11D_ON_Val << CFG_CFGPCLKGEN3_C11D_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_C11D_OFF              (CFG_CFGPCLKGEN3_C11D_OFF_Val << CFG_CFGPCLKGEN3_C11D_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos       _U_(12)                                              /**< (CFG_CFGPCLKGEN3) EVSYSC12 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_Msk       (_U_(0x7) << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos)        /**< (CFG_CFGPCLKGEN3) EVSYSC12 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL(value)    (CFG_CFGPCLKGEN3_EVSYSC12SEL_Msk & ((value) << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos))
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO1_Val _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO2_Val _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO3_Val _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO4_Val _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO5_Val _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO6_Val _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_EVSYSC12SEL_LPCLK_Val _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_NO_CLK    (CFG_CFGPCLKGEN3_EVSYSC12SEL_NO_CLK_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO1     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO1_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO2     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO2_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO3     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO3_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO4     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO4_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO5     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO5_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO6     (CFG_CFGPCLKGEN3_EVSYSC12SEL_REFO6_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_EVSYSC12SEL_LPCLK     (CFG_CFGPCLKGEN3_EVSYSC12SEL_LPCLK_Val << CFG_CFGPCLKGEN3_EVSYSC12SEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_C12D_Pos              _U_(15)                                              /**< (CFG_CFGPCLKGEN3) C12D Clock Disable Position */
#define CFG_CFGPCLKGEN3_C12D_Msk              (_U_(0x1) << CFG_CFGPCLKGEN3_C12D_Pos)               /**< (CFG_CFGPCLKGEN3) C12D Clock Disable Mask */
#define CFG_CFGPCLKGEN3_C12D(value)           (CFG_CFGPCLKGEN3_C12D_Msk & ((value) << CFG_CFGPCLKGEN3_C12D_Pos))
#define   CFG_CFGPCLKGEN3_C12D_ON_Val         _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_C12D_OFF_Val        _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_C12D_ON               (CFG_CFGPCLKGEN3_C12D_ON_Val << CFG_CFGPCLKGEN3_C12D_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_C12D_OFF              (CFG_CFGPCLKGEN3_C12D_OFF_Val << CFG_CFGPCLKGEN3_C12D_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_Pos          _U_(16)                                              /**< (CFG_CFGPCLKGEN3) AC Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_ACCLKSEL_Msk          (_U_(0x7) << CFG_CFGPCLKGEN3_ACCLKSEL_Pos)           /**< (CFG_CFGPCLKGEN3) AC Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_ACCLKSEL(value)       (CFG_CFGPCLKGEN3_ACCLKSEL_Msk & ((value) << CFG_CFGPCLKGEN3_ACCLKSEL_Pos))
#define   CFG_CFGPCLKGEN3_ACCLKSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO1_Val  _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO2_Val  _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO3_Val  _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO4_Val  _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO5_Val  _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_REFO6_Val  _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_ACCLKSEL_LPCLK_Val  _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_NO_CLK       (CFG_CFGPCLKGEN3_ACCLKSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO1        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO1_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO2        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO2_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO3        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO3_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO4        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO4_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO5        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO5_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_REFO6        (CFG_CFGPCLKGEN3_ACCLKSEL_REFO6_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_ACCLKSEL_LPCLK        (CFG_CFGPCLKGEN3_ACCLKSEL_LPCLK_Val << CFG_CFGPCLKGEN3_ACCLKSEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_ACCD_Pos              _U_(19)                                              /**< (CFG_CFGPCLKGEN3) AC Clock Disable Position */
#define CFG_CFGPCLKGEN3_ACCD_Msk              (_U_(0x1) << CFG_CFGPCLKGEN3_ACCD_Pos)               /**< (CFG_CFGPCLKGEN3) AC Clock Disable Mask */
#define CFG_CFGPCLKGEN3_ACCD(value)           (CFG_CFGPCLKGEN3_ACCD_Msk & ((value) << CFG_CFGPCLKGEN3_ACCD_Pos))
#define   CFG_CFGPCLKGEN3_ACCD_ON_Val         _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_ACCD_OFF_Val        _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_ACCD_ON               (CFG_CFGPCLKGEN3_ACCD_ON_Val << CFG_CFGPCLKGEN3_ACCD_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_ACCD_OFF              (CFG_CFGPCLKGEN3_ACCD_OFF_Val << CFG_CFGPCLKGEN3_ACCD_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_Pos          _U_(20)                                              /**< (CFG_CFGPCLKGEN3) TCC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TCC0CSEL_Msk          (_U_(0x7) << CFG_CFGPCLKGEN3_TCC0CSEL_Pos)           /**< (CFG_CFGPCLKGEN3) TCC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TCC0CSEL(value)       (CFG_CFGPCLKGEN3_TCC0CSEL_Msk & ((value) << CFG_CFGPCLKGEN3_TCC0CSEL_Pos))
#define   CFG_CFGPCLKGEN3_TCC0CSEL_NO_CLK_Val _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO1_Val  _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO2_Val  _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO3_Val  _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO4_Val  _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO5_Val  _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_REFO6_Val  _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK_Val  _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_NO_CLK       (CFG_CFGPCLKGEN3_TCC0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO1        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO2        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO3        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO4        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO5        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_REFO6        (CFG_CFGPCLKGEN3_TCC0CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK        (CFG_CFGPCLKGEN3_TCC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TCC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TCC0CD_Pos            _U_(23)                                              /**< (CFG_CFGPCLKGEN3) TCC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TCC0CD_Msk            (_U_(0x1) << CFG_CFGPCLKGEN3_TCC0CD_Pos)             /**< (CFG_CFGPCLKGEN3) TCC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TCC0CD(value)         (CFG_CFGPCLKGEN3_TCC0CD_Msk & ((value) << CFG_CFGPCLKGEN3_TCC0CD_Pos))
#define   CFG_CFGPCLKGEN3_TCC0CD_ON_Val       _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TCC0CD_OFF_Val      _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TCC0CD_ON             (CFG_CFGPCLKGEN3_TCC0CD_ON_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TCC0CD_OFF            (CFG_CFGPCLKGEN3_TCC0CD_OFF_Val << CFG_CFGPCLKGEN3_TCC0CD_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
