Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
#define CFG_CFGPCLKGEN3_TC0CSEL_Pos           _U_(24)                                              /**< (CFG_CFGPCLKGEN3) TC0 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TC0CSEL_Msk           (_U_(0x7) << CFG_CFGPCLKGEN3_TC0CSEL_Pos)            /**< (CFG_CFGPCLKGEN3) TC0 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TC0CSEL(value)        (CFG_CFGPCLKGEN3_TC0CSEL_Msk & ((value) << CFG_CFGPCLKGEN3_TC0CSEL_Pos))
#define   CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK_Val  _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO1_Val   _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO2_Val   _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO3_Val   _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO4_Val   _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO5_Val   _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_REFO6_Val   _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TC0CSEL_LPCLK_Val   _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK        (CFG_CFGPCLKGEN3_TC0CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO1         (CFG_CFGPCLKGEN3_TC0CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO2         (CFG_CFGPCLKGEN3_TC0CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO3         (CFG_CFGPCLKGEN3_TC0CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO4         (CFG_CFGPCLKGEN3_TC0CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO5         (CFG_CFGPCLKGEN3_TC0CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_REFO6         (CFG_CFGPCLKGEN3_TC0CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TC0CSEL_LPCLK         (CFG_CFGPCLKGEN3_TC0CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TC0CSEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TC0CD_Pos             _U_(27)                                              /**< (CFG_CFGPCLKGEN3) TC0 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TC0CD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN3_TC0CD_Pos)              /**< (CFG_CFGPCLKGEN3) TC0 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TC0CD(value)          (CFG_CFGPCLKGEN3_TC0CD_Msk & ((value) << CFG_CFGPCLKGEN3_TC0CD_Pos))
#define   CFG_CFGPCLKGEN3_TC0CD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TC0CD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TC0CD_ON              (CFG_CFGPCLKGEN3_TC0CD_ON_Val << CFG_CFGPCLKGEN3_TC0CD_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC0CD_OFF             (CFG_CFGPCLKGEN3_TC0CD_OFF_Val << CFG_CFGPCLKGEN3_TC0CD_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_Pos           _U_(28)                                              /**< (CFG_CFGPCLKGEN3) TC1 Peripheral Clock Selection Position */
#define CFG_CFGPCLKGEN3_TC1CSEL_Msk           (_U_(0x7) << CFG_CFGPCLKGEN3_TC1CSEL_Pos)            /**< (CFG_CFGPCLKGEN3) TC1 Peripheral Clock Selection Mask */
#define CFG_CFGPCLKGEN3_TC1CSEL(value)        (CFG_CFGPCLKGEN3_TC1CSEL_Msk & ((value) << CFG_CFGPCLKGEN3_TC1CSEL_Pos))
#define   CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK_Val  _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) No Clock  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO1_Val   _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 1  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO2_Val   _U_(0x2)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 2  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO3_Val   _U_(0x3)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 3  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO4_Val   _U_(0x4)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 4  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO5_Val   _U_(0x5)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 5  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_REFO6_Val   _U_(0x6)                                             /**< (CFG_CFGPCLKGEN3) Reference Clock 6  */
#define   CFG_CFGPCLKGEN3_TC1CSEL_LPCLK_Val   _U_(0x7)                                             /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock  */
#define CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK        (CFG_CFGPCLKGEN3_TC1CSEL_NO_CLK_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) No Clock Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO1         (CFG_CFGPCLKGEN3_TC1CSEL_REFO1_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 1 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO2         (CFG_CFGPCLKGEN3_TC1CSEL_REFO2_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 2 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO3         (CFG_CFGPCLKGEN3_TC1CSEL_REFO3_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 3 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO4         (CFG_CFGPCLKGEN3_TC1CSEL_REFO4_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 4 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO5         (CFG_CFGPCLKGEN3_TC1CSEL_REFO5_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 5 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_REFO6         (CFG_CFGPCLKGEN3_TC1CSEL_REFO6_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) Reference Clock 6 Position  */
#define CFG_CFGPCLKGEN3_TC1CSEL_LPCLK         (CFG_CFGPCLKGEN3_TC1CSEL_LPCLK_Val << CFG_CFGPCLKGEN3_TC1CSEL_Pos) /**< (CFG_CFGPCLKGEN3) 32 KHz Low Power Clock Position  */
#define CFG_CFGPCLKGEN3_TC1CD_Pos             _U_(31)                                              /**< (CFG_CFGPCLKGEN3) TC1 Clock Disable Position */
#define CFG_CFGPCLKGEN3_TC1CD_Msk             (_U_(0x1) << CFG_CFGPCLKGEN3_TC1CD_Pos)              /**< (CFG_CFGPCLKGEN3) TC1 Clock Disable Mask */
#define CFG_CFGPCLKGEN3_TC1CD(value)          (CFG_CFGPCLKGEN3_TC1CD_Msk & ((value) << CFG_CFGPCLKGEN3_TC1CD_Pos))
#define   CFG_CFGPCLKGEN3_TC1CD_ON_Val        _U_(0x1)                                             /**< (CFG_CFGPCLKGEN3) Enable PGCLK  */
#define   CFG_CFGPCLKGEN3_TC1CD_OFF_Val       _U_(0x0)                                             /**< (CFG_CFGPCLKGEN3) Disable PGCLK  */
#define CFG_CFGPCLKGEN3_TC1CD_ON              (CFG_CFGPCLKGEN3_TC1CD_ON_Val << CFG_CFGPCLKGEN3_TC1CD_Pos) /**< (CFG_CFGPCLKGEN3) Enable PGCLK Position  */
#define CFG_CFGPCLKGEN3_TC1CD_OFF             (CFG_CFGPCLKGEN3_TC1CD_OFF_Val << CFG_CFGPCLKGEN3_TC1CD_Pos) /**< (CFG_CFGPCLKGEN3) Disable PGCLK Position  */
#define CFG_CFGPCLKGEN3_Msk                   _U_(0xFFFFFFFF)                                      /**< (CFG_CFGPCLKGEN3) Register Mask  */


/* -------- CFG_ID : (CFG Offset: 0x90) ( R/ 32) Device ID -------- */
#define CFG_ID_RESETVALUE                     _U_(0x00)                                            /**<  (CFG_ID) Device ID  Reset Value */

#define CFG_ID_Msk                            _U_(0x00000000)                                      /**< (CFG_ID) Register Mask  */


/* -------- CFG_USER_ID : (CFG Offset: 0xA0) (R/W 32)  -------- */
#define CFG_USER_ID_RESETVALUE                _U_(0x00)                                            /**<  (CFG_USER_ID)   Reset Value */

#define CFG_USER_ID_USER_ID_Pos               _U_(0)                                               /**< (CFG_USER_ID) User unique ID, readable using the JTAG USER_ID instruction Position */
#define CFG_USER_ID_USER_ID_Msk               (_U_(0xFFFF) << CFG_USER_ID_USER_ID_Pos)             /**< (CFG_USER_ID) User unique ID, readable using the JTAG USER_ID instruction Mask */
#define CFG_USER_ID_USER_ID(value)            (CFG_USER_ID_USER_ID_Msk & ((value) << CFG_USER_ID_USER_ID_Pos))
#define CFG_USER_ID_Msk                       _U_(0x0000FFFF)                                      /**< (CFG_USER_ID) Register Mask  */


/* -------- CFG_SYSKEY : (CFG Offset: 0xB0) (R/W 32)  -------- */
#define CFG_SYSKEY_RESETVALUE                 _U_(0x00)                                            /**<  (CFG_SYSKEY)   Reset Value */

#define CFG_SYSKEY_SYSKEY_Pos                 _U_(0)                                               /**< (CFG_SYSKEY) System Key Position */
#define CFG_SYSKEY_SYSKEY_Msk                 (_U_(0xFFFFFFFF) << CFG_SYSKEY_SYSKEY_Pos)           /**< (CFG_SYSKEY) System Key Mask */
#define CFG_SYSKEY_SYSKEY(value)              (CFG_SYSKEY_SYSKEY_Msk & ((value) << CFG_SYSKEY_SYSKEY_Pos))
#define CFG_SYSKEY_Msk                        _U_(0xFFFFFFFF)                                      /**< (CFG_SYSKEY) Register Mask  */


/* -------- CFG_PMD1 : (CFG Offset: 0xC0) (R/W 32)  -------- */
#define CFG_PMD1_RESETVALUE                   _U_(0x00)                                            /**<  (CFG_PMD1)   Reset Value */

#define CFG_PMD1_ZBMD_Pos                     _U_(0)                                               /**< (CFG_PMD1) ZigBee Module Disable Position */
#define CFG_PMD1_ZBMD_Msk                     (_U_(0x1) << CFG_PMD1_ZBMD_Pos)                      /**< (CFG_PMD1) ZigBee Module Disable Mask */
#define CFG_PMD1_ZBMD(value)                  (CFG_PMD1_ZBMD_Msk & ((value) << CFG_PMD1_ZBMD_Pos))
#define CFG_PMD1_BTMD_Pos                     _U_(1)                                               /**< (CFG_PMD1) Bluetooth Module Disable Position */
#define CFG_PMD1_BTMD_Msk                     (_U_(0x1) << CFG_PMD1_BTMD_Pos)                      /**< (CFG_PMD1) Bluetooth Module Disable Mask */
#define CFG_PMD1_BTMD(value)                  (CFG_PMD1_BTMD_Msk & ((value) << CFG_PMD1_BTMD_Pos))
#define CFG_PMD1_MPAMD_Pos                    _U_(2)                                               /**< (CFG_PMD1) RF MPA Module Disable Position */
#define CFG_PMD1_MPAMD_Msk                    (_U_(0x1) << CFG_PMD1_MPAMD_Pos)                     /**< (CFG_PMD1) RF MPA Module Disable Mask */
#define CFG_PMD1_MPAMD(value)                 (CFG_PMD1_MPAMD_Msk & ((value) << CFG_PMD1_MPAMD_Pos))
#define CFG_PMD1_LPAMD_Pos                    _U_(3)                                               /**< (CFG_PMD1) RF LPA Module Disable Position */
#define CFG_PMD1_LPAMD_Msk                    (_U_(0x1) << CFG_PMD1_LPAMD_Pos)                     /**< (CFG_PMD1) RF LPA Module Disable Mask */
#define CFG_PMD1_LPAMD(value)                 (CFG_PMD1_LPAMD_Msk & ((value) << CFG_PMD1_LPAMD_Pos))
#define CFG_PMD1_PLVDMD_Pos                   _U_(4)                                               /**< (CFG_PMD1) PLVD Module Disable Position */
#define CFG_PMD1_PLVDMD_Msk                   (_U_(0x1) << CFG_PMD1_PLVDMD_Pos)                    /**< (CFG_PMD1) PLVD Module Disable Mask */
#define CFG_PMD1_PLVDMD(value)                (CFG_PMD1_PLVDMD_Msk & ((value) << CFG_PMD1_PLVDMD_Pos))
#define CFG_PMD1_ACMD_Pos                     _U_(6)                                               /**< (CFG_PMD1) AC Module Disable Position */
#define CFG_PMD1_ACMD_Msk                     (_U_(0x1) << CFG_PMD1_ACMD_Pos)                      /**< (CFG_PMD1) AC Module Disable Mask */
#define CFG_PMD1_ACMD(value)                  (CFG_PMD1_ACMD_Msk & ((value) << CFG_PMD1_ACMD_Pos))
#define CFG_PMD1_ADCMD_Pos                    _U_(7)                                               /**< (CFG_PMD1) ADC Controller Module Disable Position */
#define CFG_PMD1_ADCMD_Msk                    (_U_(0x1) << CFG_PMD1_ADCMD_Pos)                     /**< (CFG_PMD1) ADC Controller Module Disable Mask */
#define CFG_PMD1_ADCMD(value)                 (CFG_PMD1_ADCMD_Msk & ((value) << CFG_PMD1_ADCMD_Pos))
#define CFG_PMD1_ADCSARMD_Pos                 _U_(8)                                               /**< (CFG_PMD1) Shared ADC SAR Core Module Disable Position */
#define CFG_PMD1_ADCSARMD_Msk                 (_U_(0x1) << CFG_PMD1_ADCSARMD_Pos)                  /**< (CFG_PMD1) Shared ADC SAR Core Module Disable Mask */
#define CFG_PMD1_ADCSARMD(value)              (CFG_PMD1_ADCSARMD_Msk & ((value) << CFG_PMD1_ADCSARMD_Pos))
#define CFG_PMD1_RTCCMD_Pos                   _U_(16)                                              /**< (CFG_PMD1) RTCC Module Disable Position */
#define CFG_PMD1_RTCCMD_Msk                   (_U_(0x1) << CFG_PMD1_RTCCMD_Pos)                    /**< (CFG_PMD1) RTCC Module Disable Mask */
#define CFG_PMD1_RTCCMD(value)                (CFG_PMD1_RTCCMD_Msk & ((value) << CFG_PMD1_RTCCMD_Pos))
#define CFG_PMD1_SQIMD_Pos                    _U_(29)                                              /**< (CFG_PMD1) SQI Module Disable Position */
#define CFG_PMD1_SQIMD_Msk                    (_U_(0x1) << CFG_PMD1_SQIMD_Pos)                     /**< (CFG_PMD1) SQI Module Disable Mask */
#define CFG_PMD1_SQIMD(value)                 (CFG_PMD1_SQIMD_Msk & ((value) << CFG_PMD1_SQIMD_Pos))
#define CFG_PMD1_Msk                          _U_(0x200101DF)                                      /**< (CFG_PMD1) Register Mask  */


