Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
/* -------- CFG_PMD2 : (CFG Offset: 0xD0) (R/W 32)  -------- */
#define CFG_PMD2_RESETVALUE                   _U_(0x00)                                            /**<  (CFG_PMD2)   Reset Value */

#define CFG_PMD2_REFO5MD_Pos                  _U_(24)                                              /**< (CFG_PMD2) Reference (Clock) Out 5 Module Disable Position */
#define CFG_PMD2_REFO5MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO5MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 5 Module Disable Mask */
#define CFG_PMD2_REFO5MD(value)               (CFG_PMD2_REFO5MD_Msk & ((value) << CFG_PMD2_REFO5MD_Pos))
#define CFG_PMD2_REFO6MD_Pos                  _U_(25)                                              /**< (CFG_PMD2) Reference (Clock) Out 6 Module Disable Position */
#define CFG_PMD2_REFO6MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO6MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 6 Module Disable Mask */
#define CFG_PMD2_REFO6MD(value)               (CFG_PMD2_REFO6MD_Msk & ((value) << CFG_PMD2_REFO6MD_Pos))
#define CFG_PMD2_REFO1MD_Pos                  _U_(28)                                              /**< (CFG_PMD2) Reference (Clock) Out 1 Module Disable Position */
#define CFG_PMD2_REFO1MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO1MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 1 Module Disable Mask */
#define CFG_PMD2_REFO1MD(value)               (CFG_PMD2_REFO1MD_Msk & ((value) << CFG_PMD2_REFO1MD_Pos))
#define CFG_PMD2_REFO2MD_Pos                  _U_(29)                                              /**< (CFG_PMD2) Reference (Clock) Out 2 Module Disable Position */
#define CFG_PMD2_REFO2MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO2MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 2 Module Disable Mask */
#define CFG_PMD2_REFO2MD(value)               (CFG_PMD2_REFO2MD_Msk & ((value) << CFG_PMD2_REFO2MD_Pos))
#define CFG_PMD2_REFO3MD_Pos                  _U_(30)                                              /**< (CFG_PMD2) Reference (Clock) Out 3 Module Disable Position */
#define CFG_PMD2_REFO3MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO3MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 3 Module Disable Mask */
#define CFG_PMD2_REFO3MD(value)               (CFG_PMD2_REFO3MD_Msk & ((value) << CFG_PMD2_REFO3MD_Pos))
#define CFG_PMD2_REFO4MD_Pos                  _U_(31)                                              /**< (CFG_PMD2) Reference (Clock) Out 4 Module Disable Position */
#define CFG_PMD2_REFO4MD_Msk                  (_U_(0x1) << CFG_PMD2_REFO4MD_Pos)                   /**< (CFG_PMD2) Reference (Clock) Out 4 Module Disable Mask */
#define CFG_PMD2_REFO4MD(value)               (CFG_PMD2_REFO4MD_Msk & ((value) << CFG_PMD2_REFO4MD_Pos))
#define CFG_PMD2_Msk                          _U_(0xF3000000)                                      /**< (CFG_PMD2) Register Mask  */


/* -------- CFG_PMD3 : (CFG Offset: 0xE0) (R/W 32)  -------- */
#define CFG_PMD3_RESETVALUE                   _U_(0x00)                                            /**<  (CFG_PMD3)   Reset Value */

#define CFG_PMD3_SER1MD_Pos                   _U_(0)                                               /**< (CFG_PMD3) SERCOM1 Module Disable Position */
#define CFG_PMD3_SER1MD_Msk                   (_U_(0x1) << CFG_PMD3_SER1MD_Pos)                    /**< (CFG_PMD3) SERCOM1 Module Disable Mask */
#define CFG_PMD3_SER1MD(value)                (CFG_PMD3_SER1MD_Msk & ((value) << CFG_PMD3_SER1MD_Pos))
#define CFG_PMD3_SER2MD_Pos                   _U_(1)                                               /**< (CFG_PMD3) SERCOM2 Module Disable Position */
#define CFG_PMD3_SER2MD_Msk                   (_U_(0x1) << CFG_PMD3_SER2MD_Pos)                    /**< (CFG_PMD3) SERCOM2 Module Disable Mask */
#define CFG_PMD3_SER2MD(value)                (CFG_PMD3_SER2MD_Msk & ((value) << CFG_PMD3_SER2MD_Pos))
#define CFG_PMD3_SER3MD_Pos                   _U_(2)                                               /**< (CFG_PMD3) SERCOM3 Module Disable Position */
#define CFG_PMD3_SER3MD_Msk                   (_U_(0x1) << CFG_PMD3_SER3MD_Pos)                    /**< (CFG_PMD3) SERCOM3 Module Disable Mask */
#define CFG_PMD3_SER3MD(value)                (CFG_PMD3_SER3MD_Msk & ((value) << CFG_PMD3_SER3MD_Pos))
#define CFG_PMD3_SER4MD_Pos                   _U_(3)                                               /**< (CFG_PMD3) SERCOM4 Module Disable Position */
#define CFG_PMD3_SER4MD_Msk                   (_U_(0x1) << CFG_PMD3_SER4MD_Pos)                    /**< (CFG_PMD3) SERCOM4 Module Disable Mask */
#define CFG_PMD3_SER4MD(value)                (CFG_PMD3_SER4MD_Msk & ((value) << CFG_PMD3_SER4MD_Pos))
#define CFG_PMD3_ICMMD_Pos                    _U_(4)                                               /**< (CFG_PMD3) ICM Module Disable Position */
#define CFG_PMD3_ICMMD_Msk                    (_U_(0x1) << CFG_PMD3_ICMMD_Pos)                     /**< (CFG_PMD3) ICM Module Disable Mask */
#define CFG_PMD3_ICMMD(value)                 (CFG_PMD3_ICMMD_Msk & ((value) << CFG_PMD3_ICMMD_Pos))
#define CFG_PMD3_PUKCCMD_Pos                  _U_(5)                                               /**< (CFG_PMD3) PUKCC Module Disable Position */
#define CFG_PMD3_PUKCCMD_Msk                  (_U_(0x1) << CFG_PMD3_PUKCCMD_Pos)                   /**< (CFG_PMD3) PUKCC Module Disable Mask */
#define CFG_PMD3_PUKCCMD(value)               (CFG_PMD3_PUKCCMD_Msk & ((value) << CFG_PMD3_PUKCCMD_Pos))
#define CFG_PMD3_RNGMD_Pos                    _U_(6)                                               /**< (CFG_PMD3) TRNG Module Disable Position */
#define CFG_PMD3_RNGMD_Msk                    (_U_(0x1) << CFG_PMD3_RNGMD_Pos)                     /**< (CFG_PMD3) TRNG Module Disable Mask */
#define CFG_PMD3_RNGMD(value)                 (CFG_PMD3_RNGMD_Msk & ((value) << CFG_PMD3_RNGMD_Pos))
#define CFG_PMD3_AESMD_Pos                    _U_(7)                                               /**< (CFG_PMD3) AES Module Disable Position */
#define CFG_PMD3_AESMD_Msk                    (_U_(0x1) << CFG_PMD3_AESMD_Pos)                     /**< (CFG_PMD3) AES Module Disable Mask */
#define CFG_PMD3_AESMD(value)                 (CFG_PMD3_AESMD_Msk & ((value) << CFG_PMD3_AESMD_Pos))
#define CFG_PMD3_TC0MD_Pos                    _U_(8)                                               /**< (CFG_PMD3) TC0 Module Disable Position */
#define CFG_PMD3_TC0MD_Msk                    (_U_(0x1) << CFG_PMD3_TC0MD_Pos)                     /**< (CFG_PMD3) TC0 Module Disable Mask */
#define CFG_PMD3_TC0MD(value)                 (CFG_PMD3_TC0MD_Msk & ((value) << CFG_PMD3_TC0MD_Pos))
#define CFG_PMD3_TC1MD_Pos                    _U_(9)                                               /**< (CFG_PMD3) TC1 Module Disable Position */
#define CFG_PMD3_TC1MD_Msk                    (_U_(0x1) << CFG_PMD3_TC1MD_Pos)                     /**< (CFG_PMD3) TC1 Module Disable Mask */
#define CFG_PMD3_TC1MD(value)                 (CFG_PMD3_TC1MD_Msk & ((value) << CFG_PMD3_TC1MD_Pos))
#define CFG_PMD3_TC2MD_Pos                    _U_(10)                                              /**< (CFG_PMD3) TC2 Module Disable Position */
#define CFG_PMD3_TC2MD_Msk                    (_U_(0x1) << CFG_PMD3_TC2MD_Pos)                     /**< (CFG_PMD3) TC2 Module Disable Mask */
#define CFG_PMD3_TC2MD(value)                 (CFG_PMD3_TC2MD_Msk & ((value) << CFG_PMD3_TC2MD_Pos))
#define CFG_PMD3_TC3MD_Pos                    _U_(11)                                              /**< (CFG_PMD3) TC3 Module Disable Position */
#define CFG_PMD3_TC3MD_Msk                    (_U_(0x1) << CFG_PMD3_TC3MD_Pos)                     /**< (CFG_PMD3) TC3 Module Disable Mask */
#define CFG_PMD3_TC3MD(value)                 (CFG_PMD3_TC3MD_Msk & ((value) << CFG_PMD3_TC3MD_Pos))
#define CFG_PMD3_TCC0MD_Pos                   _U_(12)                                              /**< (CFG_PMD3) TCC0 Module Disable Position */
#define CFG_PMD3_TCC0MD_Msk                   (_U_(0x1) << CFG_PMD3_TCC0MD_Pos)                    /**< (CFG_PMD3) TCC0 Module Disable Mask */
#define CFG_PMD3_TCC0MD(value)                (CFG_PMD3_TCC0MD_Msk & ((value) << CFG_PMD3_TCC0MD_Pos))
#define CFG_PMD3_TCC1MD_Pos                   _U_(13)                                              /**< (CFG_PMD3) TCC1 Module Disable Position */
#define CFG_PMD3_TCC1MD_Msk                   (_U_(0x1) << CFG_PMD3_TCC1MD_Pos)                    /**< (CFG_PMD3) TCC1 Module Disable Mask */
#define CFG_PMD3_TCC1MD(value)                (CFG_PMD3_TCC1MD_Msk & ((value) << CFG_PMD3_TCC1MD_Pos))
#define CFG_PMD3_TCC2MD_Pos                   _U_(14)                                              /**< (CFG_PMD3) TCC2 Module Disable Position */
#define CFG_PMD3_TCC2MD_Msk                   (_U_(0x1) << CFG_PMD3_TCC2MD_Pos)                    /**< (CFG_PMD3) TCC2 Module Disable Mask */
#define CFG_PMD3_TCC2MD(value)                (CFG_PMD3_TCC2MD_Msk & ((value) << CFG_PMD3_TCC2MD_Pos))
#define CFG_PMD3_Msk                          _U_(0x00007FFF)                                      /**< (CFG_PMD3) Register Mask  */


/* -------- CFG_MISCSTAT : (CFG Offset: 0x100) (R/W 32)  -------- */
#define CFG_MISCSTAT_RESETVALUE               _U_(0x1000081)                                       /**<  (CFG_MISCSTAT)   Reset Value */

#define CFG_MISCSTAT_CLDORDY_Pos              _U_(9)                                               /**< (CFG_MISCSTAT) CLDO Ready Position */
#define CFG_MISCSTAT_CLDORDY_Msk              (_U_(0x1) << CFG_MISCSTAT_CLDORDY_Pos)               /**< (CFG_MISCSTAT) CLDO Ready Mask */
#define CFG_MISCSTAT_CLDORDY(value)           (CFG_MISCSTAT_CLDORDY_Msk & ((value) << CFG_MISCSTAT_CLDORDY_Pos))
#define CFG_MISCSTAT_Msk                      _U_(0x00000200)                                      /**< (CFG_MISCSTAT) Register Mask  */


/* -------- CFG_BCFG0 : (CFG Offset: 0x200) ( R/ 32)  -------- */
#define CFG_BCFG0_RESETVALUE                  _U_(0x00)                                            /**<  (CFG_BCFG0)   Reset Value */

#define CFG_BCFG0_PCSCMODE_Pos                _U_(1)                                               /**< (CFG_BCFG0) PCHE Single cache Mode Position */
#define CFG_BCFG0_PCSCMODE_Msk                (_U_(0x1) << CFG_BCFG0_PCSCMODE_Pos)                 /**< (CFG_BCFG0) PCHE Single cache Mode Mask */
#define CFG_BCFG0_PCSCMODE(value)             (CFG_BCFG0_PCSCMODE_Msk & ((value) << CFG_BCFG0_PCSCMODE_Pos))
#define CFG_BCFG0_CP_Pos                      _U_(28)                                              /**< (CFG_BCFG0) Boot Code Protect Position */
#define CFG_BCFG0_CP_Msk                      (_U_(0x1) << CFG_BCFG0_CP_Pos)                       /**< (CFG_BCFG0) Boot Code Protect Mask */
#define CFG_BCFG0_CP(value)                   (CFG_BCFG0_CP_Msk & ((value) << CFG_BCFG0_CP_Pos))  
#define CFG_BCFG0_SIGN_Pos                    _U_(29)                                              /**< (CFG_BCFG0) Flash SIGN Position */
#define CFG_BCFG0_SIGN_Msk                    (_U_(0x1) << CFG_BCFG0_SIGN_Pos)                     /**< (CFG_BCFG0) Flash SIGN Mask */
#define CFG_BCFG0_SIGN(value)                 (CFG_BCFG0_SIGN_Msk & ((value) << CFG_BCFG0_SIGN_Pos))
#define CFG_BCFG0_BINFOVALID0_Pos             _U_(31)                                              /**< (CFG_BCFG0) First 256-bit BCFG information Valid Position */
#define CFG_BCFG0_BINFOVALID0_Msk             (_U_(0x1) << CFG_BCFG0_BINFOVALID0_Pos)              /**< (CFG_BCFG0) First 256-bit BCFG information Valid Mask */
#define CFG_BCFG0_BINFOVALID0(value)          (CFG_BCFG0_BINFOVALID0_Msk & ((value) << CFG_BCFG0_BINFOVALID0_Pos))
#define CFG_BCFG0_Msk                         _U_(0xB0000002)                                      /**< (CFG_BCFG0) Register Mask  */

#define CFG_BCFG0_BINFOVALID_Pos              _U_(31)                                              /**< (CFG_BCFG0 Position) First 256-bit BCFG information Valid */
#define CFG_BCFG0_BINFOVALID_Msk              (_U_(0x1) << CFG_BCFG0_BINFOVALID_Pos)               /**< (CFG_BCFG0 Mask) BINFOVALID */
#define CFG_BCFG0_BINFOVALID(value)           (CFG_BCFG0_BINFOVALID_Msk & ((value) << CFG_BCFG0_BINFOVALID_Pos)) 

