Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
/* -------- CFG_CFGPCLKGEN1SET : (CFG Offset: 0x68) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN1SET_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN1SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN1SET_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN1SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN1INV : (CFG Offset: 0x6C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN1INV_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN1INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN1INV_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN1INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN2CLR : (CFG Offset: 0x74) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN2CLR_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN2CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN2CLR_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN2CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN2SET : (CFG Offset: 0x78) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN2SET_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN2SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN2SET_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN2SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN2INV : (CFG Offset: 0x7C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN2INV_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN2INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN2INV_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN2INV) Register Mask  */


/* -------- CFG_CFGPCLKGEN3CLR : (CFG Offset: 0x84) (R/W 32) Bit clear register -------- */
#define CFG_CFGPCLKGEN3CLR_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN3CLR) Bit clear register  Reset Value */

#define CFG_CFGPCLKGEN3CLR_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN3CLR) Register Mask  */


/* -------- CFG_CFGPCLKGEN3SET : (CFG Offset: 0x88) (R/W 32) Bit set register -------- */
#define CFG_CFGPCLKGEN3SET_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN3SET) Bit set register  Reset Value */

#define CFG_CFGPCLKGEN3SET_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN3SET) Register Mask  */


/* -------- CFG_CFGPCLKGEN3INV : (CFG Offset: 0x8C) (R/W 32) Bit invert register -------- */
#define CFG_CFGPCLKGEN3INV_RESETVALUE         _U_(0x00)                                            /**<  (CFG_CFGPCLKGEN3INV) Bit invert register  Reset Value */

#define CFG_CFGPCLKGEN3INV_Msk                _U_(0x00000000)                                      /**< (CFG_CFGPCLKGEN3INV) Register Mask  */


/* -------- CFG_USER_IDCLR : (CFG Offset: 0xA4) (R/W 32) Bit clear register -------- */
#define CFG_USER_IDCLR_RESETVALUE             _U_(0x00)                                            /**<  (CFG_USER_IDCLR) Bit clear register  Reset Value */

#define CFG_USER_IDCLR_Msk                    _U_(0x00000000)                                      /**< (CFG_USER_IDCLR) Register Mask  */


/* -------- CFG_USER_IDSET : (CFG Offset: 0xA8) (R/W 32) Bit set register -------- */
#define CFG_USER_IDSET_RESETVALUE             _U_(0x00)                                            /**<  (CFG_USER_IDSET) Bit set register  Reset Value */

#define CFG_USER_IDSET_Msk                    _U_(0x00000000)                                      /**< (CFG_USER_IDSET) Register Mask  */


/* -------- CFG_USER_IDINV : (CFG Offset: 0xAC) (R/W 32) Bit invert register -------- */
#define CFG_USER_IDINV_RESETVALUE             _U_(0x00)                                            /**<  (CFG_USER_IDINV) Bit invert register  Reset Value */

#define CFG_USER_IDINV_Msk                    _U_(0x00000000)                                      /**< (CFG_USER_IDINV) Register Mask  */


/* -------- CFG_PMD1CLR : (CFG Offset: 0xC4) (R/W 32) Bit clear register -------- */
#define CFG_PMD1CLR_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD1CLR) Bit clear register  Reset Value */

#define CFG_PMD1CLR_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD1CLR) Register Mask  */


/* -------- CFG_PMD1SET : (CFG Offset: 0xC8) (R/W 32) Bit set register -------- */
#define CFG_PMD1SET_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD1SET) Bit set register  Reset Value */

#define CFG_PMD1SET_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD1SET) Register Mask  */


/* -------- CFG_PMD1INV : (CFG Offset: 0xCC) (R/W 32) Bit invert register -------- */
#define CFG_PMD1INV_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD1INV) Bit invert register  Reset Value */

#define CFG_PMD1INV_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD1INV) Register Mask  */


/* -------- CFG_PMD2CLR : (CFG Offset: 0xD4) (R/W 32) Bit clear register -------- */
#define CFG_PMD2CLR_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD2CLR) Bit clear register  Reset Value */

#define CFG_PMD2CLR_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD2CLR) Register Mask  */


/* -------- CFG_PMD2SET : (CFG Offset: 0xD8) (R/W 32) Bit set register -------- */
#define CFG_PMD2SET_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD2SET) Bit set register  Reset Value */

#define CFG_PMD2SET_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD2SET) Register Mask  */


/* -------- CFG_PMD2INV : (CFG Offset: 0xDC) (R/W 32) Bit invert register -------- */
#define CFG_PMD2INV_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD2INV) Bit invert register  Reset Value */

#define CFG_PMD2INV_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD2INV) Register Mask  */


/* -------- CFG_PMD3CLR : (CFG Offset: 0xE4) (R/W 32) Bit clear register -------- */
#define CFG_PMD3CLR_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD3CLR) Bit clear register  Reset Value */

#define CFG_PMD3CLR_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD3CLR) Register Mask  */


/* -------- CFG_PMD3SET : (CFG Offset: 0xE8) (R/W 32) Bit set register -------- */
#define CFG_PMD3SET_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD3SET) Bit set register  Reset Value */

#define CFG_PMD3SET_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD3SET) Register Mask  */


