Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.73/WBZ450/include/component/cfg.h
/* -------- CFG_PMD3INV : (CFG Offset: 0xEC) (R/W 32) Bit invert register -------- */
#define CFG_PMD3INV_RESETVALUE                _U_(0x00)                                            /**<  (CFG_PMD3INV) Bit invert register  Reset Value */

#define CFG_PMD3INV_Msk                       _U_(0x00000000)                                      /**< (CFG_PMD3INV) Register Mask  */


/** \brief CFG register offsets definitions */
#define CFG_CFGCON0_REG_OFST           (0x00)              /**< (CFG_CFGCON0)  Offset */
#define CFG_CFGCON1_REG_OFST           (0x10)              /**< (CFG_CFGCON1)  Offset */
#define CFG_CFGCON2_REG_OFST           (0x20)              /**< (CFG_CFGCON2)  Offset */
#define CFG_CFGCON4_REG_OFST           (0x40)              /**< (CFG_CFGCON4)  Offset */
#define CFG_CFGPGQOS_REG_OFST          (0x50)              /**< (CFG_CFGPGQOS)  Offset */
#define CFG_CFGPCLKGEN1_REG_OFST       (0x60)              /**< (CFG_CFGPCLKGEN1)  Offset */
#define CFG_CFGPCLKGEN2_REG_OFST       (0x70)              /**< (CFG_CFGPCLKGEN2)  Offset */
#define CFG_CFGPCLKGEN3_REG_OFST       (0x80)              /**< (CFG_CFGPCLKGEN3)  Offset */
#define CFG_ID_REG_OFST                (0x90)              /**< (CFG_ID) Device ID Offset */
#define CFG_USER_ID_REG_OFST           (0xA0)              /**< (CFG_USER_ID)  Offset */
#define CFG_SYSKEY_REG_OFST            (0xB0)              /**< (CFG_SYSKEY)  Offset */
#define CFG_PMD1_REG_OFST              (0xC0)              /**< (CFG_PMD1)  Offset */
#define CFG_PMD2_REG_OFST              (0xD0)              /**< (CFG_PMD2)  Offset */
#define CFG_PMD3_REG_OFST              (0xE0)              /**< (CFG_PMD3)  Offset */
#define CFG_MISCSTAT_REG_OFST          (0x100)             /**< (CFG_MISCSTAT)  Offset */
#define CFG_BCFG0_REG_OFST             (0x200)             /**< (CFG_BCFG0)  Offset */
#define CFG_CFGCON0CLR_REG_OFST        (0x04)              /**< (CFG_CFGCON0CLR) Bit clear register Offset */
#define CFG_CFGCON0SET_REG_OFST        (0x08)              /**< (CFG_CFGCON0SET) Bit set register Offset */
#define CFG_CFGCON0INV_REG_OFST        (0x0C)              /**< (CFG_CFGCON0INV) Bit invert register Offset */
#define CFG_CFGCON1CLR_REG_OFST        (0x14)              /**< (CFG_CFGCON1CLR) Bit clear register Offset */
#define CFG_CFGCON1SET_REG_OFST        (0x18)              /**< (CFG_CFGCON1SET) Bit set register Offset */
#define CFG_CFGCON1INV_REG_OFST        (0x1C)              /**< (CFG_CFGCON1INV) Bit invert register Offset */
#define CFG_CFGCON2CLR_REG_OFST        (0x24)              /**< (CFG_CFGCON2CLR) Bit clear register Offset */
#define CFG_CFGCON2SET_REG_OFST        (0x28)              /**< (CFG_CFGCON2SET) Bit set register Offset */
#define CFG_CFGCON2INV_REG_OFST        (0x2C)              /**< (CFG_CFGCON2INV) Bit invert register Offset */
#define CFG_CFGCON4CLR_REG_OFST        (0x44)              /**< (CFG_CFGCON4CLR) Bit clear register Offset */
#define CFG_CFGCON4SET_REG_OFST        (0x48)              /**< (CFG_CFGCON4SET) Bit set register Offset */
#define CFG_CFGCON4INV_REG_OFST        (0x4C)              /**< (CFG_CFGCON4INV) Bit invert register Offset */
#define CFG_CFGPGQOSCLR_REG_OFST       (0x54)              /**< (CFG_CFGPGQOSCLR) Bit clear register Offset */
#define CFG_CFGPGQOSSET_REG_OFST       (0x58)              /**< (CFG_CFGPGQOSSET) Bit set register Offset */
#define CFG_CFGPGQOSINV_REG_OFST       (0x5C)              /**< (CFG_CFGPGQOSINV) Bit invert register Offset */
#define CFG_CFGPCLKGEN1CLR_REG_OFST    (0x64)              /**< (CFG_CFGPCLKGEN1CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN1SET_REG_OFST    (0x68)              /**< (CFG_CFGPCLKGEN1SET) Bit set register Offset */
#define CFG_CFGPCLKGEN1INV_REG_OFST    (0x6C)              /**< (CFG_CFGPCLKGEN1INV) Bit invert register Offset */
#define CFG_CFGPCLKGEN2CLR_REG_OFST    (0x74)              /**< (CFG_CFGPCLKGEN2CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN2SET_REG_OFST    (0x78)              /**< (CFG_CFGPCLKGEN2SET) Bit set register Offset */
#define CFG_CFGPCLKGEN2INV_REG_OFST    (0x7C)              /**< (CFG_CFGPCLKGEN2INV) Bit invert register Offset */
#define CFG_CFGPCLKGEN3CLR_REG_OFST    (0x84)              /**< (CFG_CFGPCLKGEN3CLR) Bit clear register Offset */
#define CFG_CFGPCLKGEN3SET_REG_OFST    (0x88)              /**< (CFG_CFGPCLKGEN3SET) Bit set register Offset */
#define CFG_CFGPCLKGEN3INV_REG_OFST    (0x8C)              /**< (CFG_CFGPCLKGEN3INV) Bit invert register Offset */
#define CFG_USER_IDCLR_REG_OFST        (0xA4)              /**< (CFG_USER_IDCLR) Bit clear register Offset */
#define CFG_USER_IDSET_REG_OFST        (0xA8)              /**< (CFG_USER_IDSET) Bit set register Offset */
#define CFG_USER_IDINV_REG_OFST        (0xAC)              /**< (CFG_USER_IDINV) Bit invert register Offset */
#define CFG_PMD1CLR_REG_OFST           (0xC4)              /**< (CFG_PMD1CLR) Bit clear register Offset */
#define CFG_PMD1SET_REG_OFST           (0xC8)              /**< (CFG_PMD1SET) Bit set register Offset */
#define CFG_PMD1INV_REG_OFST           (0xCC)              /**< (CFG_PMD1INV) Bit invert register Offset */
#define CFG_PMD2CLR_REG_OFST           (0xD4)              /**< (CFG_PMD2CLR) Bit clear register Offset */
#define CFG_PMD2SET_REG_OFST           (0xD8)              /**< (CFG_PMD2SET) Bit set register Offset */
#define CFG_PMD2INV_REG_OFST           (0xDC)              /**< (CFG_PMD2INV) Bit invert register Offset */
#define CFG_PMD3CLR_REG_OFST           (0xE4)              /**< (CFG_PMD3CLR) Bit clear register Offset */
#define CFG_PMD3SET_REG_OFST           (0xE8)              /**< (CFG_PMD3SET) Bit set register Offset */
#define CFG_PMD3INV_REG_OFST           (0xEC)              /**< (CFG_PMD3INV) Bit invert register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CFG register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       CFG_CFGCON0;        /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON0CLR;     /**< Offset: 0x04 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON0SET;     /**< Offset: 0x08 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON0INV;     /**< Offset: 0x0C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGCON1;        /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON1CLR;     /**< Offset: 0x14 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON1SET;     /**< Offset: 0x18 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON1INV;     /**< Offset: 0x1C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGCON2;        /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON2CLR;     /**< Offset: 0x24 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON2SET;     /**< Offset: 0x28 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON2INV;     /**< Offset: 0x2C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       CFG_CFGCON4;        /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGCON4CLR;     /**< Offset: 0x44 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGCON4SET;     /**< Offset: 0x48 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGCON4INV;     /**< Offset: 0x4C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPGQOS;       /**< Offset: 0x50 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPGQOSCLR;    /**< Offset: 0x54 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPGQOSSET;    /**< Offset: 0x58 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPGQOSINV;    /**< Offset: 0x5C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1;    /**< Offset: 0x60 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN1CLR; /**< Offset: 0x64 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1SET; /**< Offset: 0x68 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN1INV; /**< Offset: 0x6C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2;    /**< Offset: 0x70 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN2CLR; /**< Offset: 0x74 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2SET; /**< Offset: 0x78 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN2INV; /**< Offset: 0x7C (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3;    /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       CFG_CFGPCLKGEN3CLR; /**< Offset: 0x84 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3SET; /**< Offset: 0x88 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_CFGPCLKGEN3INV; /**< Offset: 0x8C (R/W  32) Bit invert register */
  __I   uint32_t                       CFG_ID;             /**< Offset: 0x90 (R/   32) Device ID */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  uint32_t                       CFG_USER_ID;        /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       CFG_USER_IDCLR;     /**< Offset: 0xA4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_USER_IDSET;     /**< Offset: 0xA8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_USER_IDINV;     /**< Offset: 0xAC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_SYSKEY;         /**< Offset: 0xB0 (R/W  32)  */
  __I   uint8_t                        Reserved3[0x0C];
  __IO  uint32_t                       CFG_PMD1;           /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD1CLR;        /**< Offset: 0xC4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD1SET;        /**< Offset: 0xC8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD1INV;        /**< Offset: 0xCC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_PMD2;           /**< Offset: 0xD0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD2CLR;        /**< Offset: 0xD4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD2SET;        /**< Offset: 0xD8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD2INV;        /**< Offset: 0xDC (R/W  32) Bit invert register */
  __IO  uint32_t                       CFG_PMD3;           /**< Offset: 0xE0 (R/W  32)  */
  __IO  uint32_t                       CFG_PMD3CLR;        /**< Offset: 0xE4 (R/W  32) Bit clear register */
  __IO  uint32_t                       CFG_PMD3SET;        /**< Offset: 0xE8 (R/W  32) Bit set register */
  __IO  uint32_t                       CFG_PMD3INV;        /**< Offset: 0xEC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved4[0x10];
  __IO  uint32_t                       CFG_MISCSTAT;       /**< Offset: 0x100 (R/W  32)  */
  __I   uint8_t                        Reserved5[0xFC];
  __I   uint32_t                       CFG_BCFG0;          /**< Offset: 0x200 (R/   32)  */
} cfg_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _BZ45_CFG_COMPONENT_H_ */
